; ModuleID = 'integration/pthreadrace/pthread-rwlock-no.cpp'
source_filename = "integration/pthreadrace/pthread-rwlock-no.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }

!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 603, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !7, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/ios_base.h", directory: "")
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!7 = !{!8, !12, !14, !18, !19, !24}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !4, file: !5, line: 616, baseType: !9, flags: DIFlagStaticMember)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !10, line: 32, baseType: !11)
!10 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/x86_64-pc-linux-gnu/bits/atomic_word.h", directory: "")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !4, file: !5, line: 617, baseType: !13, flags: DIFlagStaticMember)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!14 = !DISubprogram(name: "Init", scope: !4, file: !5, line: 607, type: !15, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!18 = !DISubprogram(name: "~Init", scope: !4, file: !5, line: 608, type: !15, scopeLine: 608, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!19 = !DISubprogram(name: "Init", scope: !4, file: !5, line: 611, type: !20, scopeLine: 611, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !17, !22}
!22 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!24 = !DISubprogram(name: "operator=", linkageName: "_ZNSt8ios_base4InitaSERKS0_", scope: !4, file: !5, line: 612, type: !25, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !17, !22}
!27 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4, size: 64)
!28 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !29, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, retainedTypes: !39, globals: !237, imports: !238, splitDebugInlining: false, nameTableKind: None)
!29 = !DIFile(filename: "integration/pthreadrace/pthread-rwlock-no.cpp", directory: "/home/brad/Code/OpenRace/tests/data")
!30 = !{!31}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !33, file: !32, line: 169, baseType: !36, size: 32, elements: !37, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEUt_E")
!32 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/basic_string.h", directory: "")
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !35, file: !34, line: 1618, flags: DIFlagFwdDecl, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!34 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/basic_string.tcc", directory: "")
!35 = !DINamespace(name: "__cxx11", scope: !2, exportSymbols: true)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38}
!38 = !DIEnumerator(name: "_S_local_capacity", value: 15, isUnsigned: true)
!39 = !{!40, !41, !49, !55, !92, !152, !204, !208, !228, !232, !235, !236, !78, !33}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DISubprogram(name: "perror", scope: !42, file: !42, line: 780, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !{}
!49 = !DISubprogram(name: "pthread_join", scope: !50, file: !50, line: 217, type: !51, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!50 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!51 = !DISubroutineType(types: !52)
!52 = !{!11, !53, !54}
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!55 = !DISubprogram(name: "pthread_rwlock_init", scope: !50, file: !50, line: 904, type: !56, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!56 = !DISubroutineType(types: !57)
!57 = !{!11, !58, !89}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 86, size: 448, flags: DIFlagTypePassByValue, elements: !61, identifier: "_ZTS16pthread_rwlock_t")
!60 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!61 = !{!62, !83, !87}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !59, file: !60, line: 88, baseType: !63, size: 448)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !64, line: 23, size: 448, flags: DIFlagTypePassByValue, elements: !65, identifier: "_ZTS23__pthread_rwlock_arch_t")
!64 = !DIFile(filename: "/usr/include/bits/struct_rwlock.h", directory: "")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !76, !81, !82}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !63, file: !64, line: 25, baseType: !36, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !63, file: !64, line: 26, baseType: !36, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !63, file: !64, line: 27, baseType: !36, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !63, file: !64, line: 28, baseType: !36, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 29, baseType: !36, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 30, baseType: !36, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !63, file: !64, line: 32, baseType: !11, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !63, file: !64, line: 33, baseType: !11, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !63, file: !64, line: 34, baseType: !75, size: 8, offset: 256)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 39, baseType: !77, size: 56, offset: 264)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 56, elements: !79)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !{!80}
!80 = !DISubrange(count: 7)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 42, baseType: !53, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !63, file: !64, line: 45, baseType: !36, size: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !59, file: !60, line: 89, baseType: !84, size: 448)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 448, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 56)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !59, file: !60, line: 90, baseType: !88, size: 64)
!88 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 93, flags: DIFlagFwdDecl, identifier: "_ZTS20pthread_rwlockattr_t")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !33, file: !32, line: 88, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !95, file: !94, line: 59, baseType: !126)
!94 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/ext/alloc_traits.h", directory: "")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<char>, char>", scope: !96, file: !94, line: 48, size: 8, flags: DIFlagTypePassByValue, elements: !97, templateParams: !150, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIcEcEE")
!96 = !DINamespace(name: "__gnu_cxx", scope: null)
!97 = !{!98, !134, !139, !143, !146, !147, !148, !149}
!98 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !99, extraData: i32 0)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<char> >", scope: !2, file: !100, line: 407, size: 8, flags: DIFlagTypePassByValue, elements: !101, templateParams: !132, identifier: "_ZTSSt16allocator_traitsISaIcEE")
!100 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/alloc_traits.h", directory: "")
!101 = !{!102, !114, !120, !123, !129}
!102 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_m", scope: !99, file: !100, line: 459, type: !103, scopeLine: 459, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !107, !111}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !99, file: !100, line: 416, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !99, file: !100, line: 410, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<char>", scope: !2, file: !110, line: 249, flags: DIFlagFwdDecl, identifier: "_ZTSSaIcE")
!110 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/allocator.h", directory: "")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !100, line: 431, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !2, file: !113, line: 260, baseType: !53)
!113 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/x86_64-pc-linux-gnu/bits/c++config.h", directory: "")
!114 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv", scope: !99, file: !100, line: 473, type: !115, scopeLine: 473, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{!105, !107, !111, !117}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !100, line: 425, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!120 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm", scope: !99, file: !100, line: 491, type: !121, scopeLine: 491, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !107, !105, !111}
!123 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_", scope: !99, file: !100, line: 543, type: !124, scopeLine: 543, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !99, file: !100, line: 431, baseType: !112)
!127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!129 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_", scope: !99, file: !100, line: 558, type: !130, scopeLine: 558, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{!108, !127}
!132 = !{!133}
!133 = !DITemplateTypeParameter(name: "_Alloc", type: !109)
!134 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE17_S_select_on_copyERKS1_", scope: !95, file: !94, line: 97, type: !135, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!109, !137}
!137 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!139 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE10_S_on_swapERS1_S3_", scope: !95, file: !94, line: 100, type: !140, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !142}
!142 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !109, size: 64)
!143 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_copy_assignEv", scope: !95, file: !94, line: 103, type: !144, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{!13}
!146 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_move_assignEv", scope: !95, file: !94, line: 106, type: !144, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!147 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE20_S_propagate_on_swapEv", scope: !95, file: !94, line: 109, type: !144, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!148 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_always_equalEv", scope: !95, file: !94, line: 112, type: !144, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!149 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_nothrow_moveEv", scope: !95, file: !94, line: 115, type: !144, scopeLine: 115, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!150 = !{!133, !151}
!151 = !DITemplateTypeParameter(type: !47)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !155, file: !154, line: 311, baseType: !47)
!154 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/char_traits.h", directory: "")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !2, file: !154, line: 309, size: 8, flags: DIFlagTypePassByValue, elements: !156, templateParams: !202, identifier: "_ZTSSt11char_traitsIcE")
!156 = !{!157, !163, !166, !167, !171, !174, !177, !180, !181, !184, !190, !193, !196, !199}
!157 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignERcRKc", scope: !155, file: !154, line: 321, type: !158, scopeLine: 321, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !160, !161}
!160 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !153, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!163 = !DISubprogram(name: "eq", linkageName: "_ZNSt11char_traitsIcE2eqERKcS2_", scope: !155, file: !154, line: 325, type: !164, scopeLine: 325, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!13, !161, !161}
!166 = !DISubprogram(name: "lt", linkageName: "_ZNSt11char_traitsIcE2ltERKcS2_", scope: !155, file: !154, line: 329, type: !164, scopeLine: 329, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!167 = !DISubprogram(name: "compare", linkageName: "_ZNSt11char_traitsIcE7compareEPKcS2_m", scope: !155, file: !154, line: 337, type: !168, scopeLine: 337, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!11, !170, !170, !112}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!171 = !DISubprogram(name: "length", linkageName: "_ZNSt11char_traitsIcE6lengthEPKc", scope: !155, file: !154, line: 351, type: !172, scopeLine: 351, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{!112, !170}
!174 = !DISubprogram(name: "find", linkageName: "_ZNSt11char_traitsIcE4findEPKcmRS1_", scope: !155, file: !154, line: 361, type: !175, scopeLine: 361, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{!170, !170, !112, !161}
!177 = !DISubprogram(name: "move", linkageName: "_ZNSt11char_traitsIcE4moveEPcPKcm", scope: !155, file: !154, line: 375, type: !178, scopeLine: 375, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!152, !152, !170, !112}
!180 = !DISubprogram(name: "copy", linkageName: "_ZNSt11char_traitsIcE4copyEPcPKcm", scope: !155, file: !154, line: 387, type: !178, scopeLine: 387, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!181 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignEPcmc", scope: !155, file: !154, line: 399, type: !182, scopeLine: 399, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!152, !152, !112, !153}
!184 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt11char_traitsIcE12to_char_typeERKi", scope: !155, file: !154, line: 411, type: !185, scopeLine: 411, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!185 = !DISubroutineType(types: !186)
!186 = !{!153, !187}
!187 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !155, file: !154, line: 312, baseType: !11)
!190 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt11char_traitsIcE11to_int_typeERKc", scope: !155, file: !154, line: 417, type: !191, scopeLine: 417, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!191 = !DISubroutineType(types: !192)
!192 = !{!189, !161}
!193 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt11char_traitsIcE11eq_int_typeERKiS2_", scope: !155, file: !154, line: 421, type: !194, scopeLine: 421, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!194 = !DISubroutineType(types: !195)
!195 = !{!13, !187, !187}
!196 = !DISubprogram(name: "eof", linkageName: "_ZNSt11char_traitsIcE3eofEv", scope: !155, file: !154, line: 425, type: !197, scopeLine: 425, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!197 = !DISubroutineType(types: !198)
!198 = !{!189}
!199 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt11char_traitsIcE7not_eofERKi", scope: !155, file: !154, line: 429, type: !200, scopeLine: 429, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!189, !187}
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "_CharT", type: !47)
!204 = !DISubprogram(name: "operator delete", linkageName: "_ZdlPv", scope: !205, file: !205, line: 130, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!205 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/new", directory: "")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !40}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BulletinRWLock", file: !29, line: 13, size: 704, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !210, identifier: "_ZTS14BulletinRWLock")
!210 = !{!211, !213, !216, !220, !221, !224}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock_", scope: !209, file: !29, line: 15, baseType: !212, size: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !60, line: 91, baseType: !59)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "message_", scope: !209, file: !29, line: 16, baseType: !214, size: 256, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !2, file: !215, line: 79, baseType: !33)
!215 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/stringfwd.h", directory: "")
!216 = !DISubprogram(name: "BulletinRWLock", scope: !209, file: !29, line: 19, type: !217, scopeLine: 19, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!220 = !DISubprogram(name: "~BulletinRWLock", scope: !209, file: !29, line: 21, type: !217, scopeLine: 21, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubprogram(name: "Read", linkageName: "_ZN14BulletinRWLock4ReadB5cxx11Ev", scope: !209, file: !29, line: 23, type: !222, scopeLine: 23, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{!214, !219}
!224 = !DISubprogram(name: "Update", linkageName: "_ZN14BulletinRWLock6UpdateENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !209, file: !29, line: 30, type: !225, scopeLine: 30, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !219, !227}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!228 = !DISubprogram(name: "sleep", scope: !229, file: !229, line: 453, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!229 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!230 = !DISubroutineType(types: !231)
!231 = !{!36, !36}
!232 = !DISubprogram(name: "pthread_rwlock_wrlock", scope: !50, file: !50, line: 935, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!233 = !DISubroutineType(types: !234)
!234 = !{!11, !58}
!235 = !DISubprogram(name: "pthread_rwlock_unlock", scope: !50, file: !50, line: 957, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!236 = !DISubprogram(name: "pthread_rwlock_rdlock", scope: !50, file: !50, line: 913, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!237 = !{!0}
!238 = !{!239, !256, !259, !264, !324, !332, !336, !343, !347, !351, !353, !355, !359, !366, !370, !376, !382, !384, !388, !392, !396, !400, !411, !413, !417, !421, !425, !427, !432, !436, !440, !442, !444, !448, !457, !461, !465, !469, !471, !477, !479, !486, !491, !495, !499, !503, !507, !511, !513, !515, !519, !523, !527, !529, !533, !537, !539, !541, !545, !550, !555, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !570, !624, !628, !632, !637, !641, !644, !647, !650, !652, !654, !656, !659, !662, !665, !668, !671, !674, !678, !681, !684, !687, !689, !691, !693, !695, !698, !701, !704, !707, !710, !712, !716, !720, !725, !731, !733, !735, !737, !739, !741, !743, !745, !747, !749, !751, !753, !755, !757, !761, !765, !771, !775, !780, !782, !787, !791, !795, !804, !808, !812, !816, !818, !822, !826, !830, !834, !838, !842, !846, !850, !852, !856, !860, !864, !870, !874, !878, !880, !884, !888, !894, !896, !900, !904, !908, !912, !916, !920, !924, !925, !926, !927, !929, !930, !931, !932, !933, !934, !935, !939, !944, !949, !953, !955, !957, !959, !961, !968, !972, !976, !980, !984, !988, !993, !997, !999, !1003, !1009, !1013, !1018, !1020, !1023, !1025, !1029, !1031, !1033, !1035, !1037, !1041, !1043, !1045, !1049, !1053, !1057, !1061, !1065, !1069, !1071, !1075, !1079, !1083, !1087, !1089, !1091, !1095, !1099, !1100, !1101, !1102, !1103, !1104, !1110, !1113, !1114, !1116, !1118, !1120, !1122, !1126, !1128, !1130, !1132, !1134, !1136, !1138, !1140, !1142, !1146, !1150, !1152, !1156}
!239 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !240, file: !255, line: 64)
!240 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !241, line: 6, baseType: !242)
!241 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!242 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !243, line: 21, baseType: !244)
!243 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !243, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !245, identifier: "_ZTS11__mbstate_t")
!245 = !{!246, !247}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !244, file: !243, line: 15, baseType: !11, size: 32)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !244, file: !243, line: 20, baseType: !248, size: 32, offset: 32)
!248 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !244, file: !243, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !249, identifier: "_ZTSN11__mbstate_tUt_E")
!249 = !{!250, !251}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !248, file: !243, line: 18, baseType: !36, size: 32)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !248, file: !243, line: 19, baseType: !252, size: 32)
!252 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !253)
!253 = !{!254}
!254 = !DISubrange(count: 4)
!255 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cwchar", directory: "")
!256 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !257, file: !255, line: 141)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !258, line: 20, baseType: !36)
!258 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!259 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !260, file: !255, line: 143)
!260 = !DISubprogram(name: "btowc", scope: !261, file: !261, line: 318, type: !262, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!261 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!262 = !DISubroutineType(types: !263)
!263 = !{!257, !11}
!264 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !265, file: !255, line: 144)
!265 = !DISubprogram(name: "fgetwc", scope: !261, file: !261, line: 729, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!266 = !DISubroutineType(types: !267)
!267 = !{!257, !268}
!268 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !269, size: 64)
!269 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !270, line: 5, baseType: !271)
!270 = !DIFile(filename: "/usr/include/bits/types/__FILE.h", directory: "")
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !272, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !273, identifier: "_ZTS8_IO_FILE")
!272 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !289, !291, !292, !293, !296, !298, !299, !303, !306, !308, !311, !314, !315, !316, !319, !320}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !271, file: !272, line: 51, baseType: !11, size: 32)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !271, file: !272, line: 54, baseType: !106, size: 64, offset: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !271, file: !272, line: 55, baseType: !106, size: 64, offset: 128)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !271, file: !272, line: 56, baseType: !106, size: 64, offset: 192)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !271, file: !272, line: 57, baseType: !106, size: 64, offset: 256)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !271, file: !272, line: 58, baseType: !106, size: 64, offset: 320)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !271, file: !272, line: 59, baseType: !106, size: 64, offset: 384)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !271, file: !272, line: 60, baseType: !106, size: 64, offset: 448)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !271, file: !272, line: 61, baseType: !106, size: 64, offset: 512)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !271, file: !272, line: 64, baseType: !106, size: 64, offset: 576)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !271, file: !272, line: 65, baseType: !106, size: 64, offset: 640)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !271, file: !272, line: 66, baseType: !106, size: 64, offset: 704)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !271, file: !272, line: 68, baseType: !287, size: 64, offset: 768)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !272, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !271, file: !272, line: 70, baseType: !290, size: 64, offset: 832)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !271, file: !272, line: 72, baseType: !11, size: 32, offset: 896)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !271, file: !272, line: 73, baseType: !11, size: 32, offset: 928)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !271, file: !272, line: 74, baseType: !294, size: 64, offset: 960)
!294 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !295, line: 152, baseType: !88)
!295 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!296 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !271, file: !272, line: 77, baseType: !297, size: 16, offset: 1024)
!297 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !271, file: !272, line: 78, baseType: !75, size: 8, offset: 1040)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !271, file: !272, line: 79, baseType: !300, size: 8, offset: 1048)
!300 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !301)
!301 = !{!302}
!302 = !DISubrange(count: 1)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !271, file: !272, line: 81, baseType: !304, size: 64, offset: 1088)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64)
!305 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !272, line: 43, baseType: null)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !271, file: !272, line: 89, baseType: !307, size: 64, offset: 1152)
!307 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !295, line: 153, baseType: !88)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !271, file: !272, line: 91, baseType: !309, size: 64, offset: 1216)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64)
!310 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !272, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTS11_IO_codecvt")
!311 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !271, file: !272, line: 92, baseType: !312, size: 64, offset: 1280)
!312 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !313, size: 64)
!313 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !272, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTS13_IO_wide_data")
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !271, file: !272, line: 93, baseType: !290, size: 64, offset: 1344)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !271, file: !272, line: 94, baseType: !40, size: 64, offset: 1408)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !271, file: !272, line: 95, baseType: !317, size: 64, offset: 1472)
!317 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !318, line: 46, baseType: !53)
!318 = !DIFile(filename: "OpenRace-env/install/lib/clang/10.0.1/include/stddef.h", directory: "/home/brad/Code")
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !271, file: !272, line: 96, baseType: !11, size: 32, offset: 1536)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !271, file: !272, line: 98, baseType: !321, size: 160, offset: 1568)
!321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !322)
!322 = !{!323}
!323 = !DISubrange(count: 20)
!324 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !325, file: !255, line: 145)
!325 = !DISubprogram(name: "fgetws", scope: !261, file: !261, line: 758, type: !326, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!326 = !DISubroutineType(types: !327)
!327 = !{!328, !330, !11, !331}
!328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !329, size: 64)
!329 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!330 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !328)
!331 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !268)
!332 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !333, file: !255, line: 146)
!333 = !DISubprogram(name: "fputwc", scope: !261, file: !261, line: 743, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!334 = !DISubroutineType(types: !335)
!335 = !{!257, !329, !268}
!336 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !337, file: !255, line: 147)
!337 = !DISubprogram(name: "fputws", scope: !261, file: !261, line: 765, type: !338, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!338 = !DISubroutineType(types: !339)
!339 = !{!11, !340, !331}
!340 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !341)
!341 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !342, size: 64)
!342 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !329)
!343 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !344, file: !255, line: 148)
!344 = !DISubprogram(name: "fwide", scope: !261, file: !261, line: 573, type: !345, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!345 = !DISubroutineType(types: !346)
!346 = !{!11, !268, !11}
!347 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !348, file: !255, line: 149)
!348 = !DISubprogram(name: "fwprintf", scope: !261, file: !261, line: 580, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!349 = !DISubroutineType(types: !350)
!350 = !{!11, !331, !340, null}
!351 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !352, file: !255, line: 150)
!352 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !261, file: !261, line: 642, type: !349, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!353 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !354, file: !255, line: 151)
!354 = !DISubprogram(name: "getwc", scope: !261, file: !261, line: 730, type: !266, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!355 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !356, file: !255, line: 152)
!356 = !DISubprogram(name: "getwchar", scope: !261, file: !261, line: 736, type: !357, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!357 = !DISubroutineType(types: !358)
!358 = !{!257}
!359 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !360, file: !255, line: 153)
!360 = !DISubprogram(name: "mbrlen", scope: !261, file: !261, line: 329, type: !361, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!361 = !DISubroutineType(types: !362)
!362 = !{!317, !363, !317, !364}
!363 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!364 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !240, size: 64)
!366 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !367, file: !255, line: 154)
!367 = !DISubprogram(name: "mbrtowc", scope: !261, file: !261, line: 296, type: !368, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!368 = !DISubroutineType(types: !369)
!369 = !{!317, !330, !363, !317, !364}
!370 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !371, file: !255, line: 155)
!371 = !DISubprogram(name: "mbsinit", scope: !261, file: !261, line: 292, type: !372, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!372 = !DISubroutineType(types: !373)
!373 = !{!11, !374}
!374 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !375, size: 64)
!375 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !240)
!376 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !377, file: !255, line: 156)
!377 = !DISubprogram(name: "mbsrtowcs", scope: !261, file: !261, line: 337, type: !378, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!378 = !DISubroutineType(types: !379)
!379 = !{!317, !330, !380, !317, !364}
!380 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !381)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!382 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !383, file: !255, line: 157)
!383 = !DISubprogram(name: "putwc", scope: !261, file: !261, line: 744, type: !334, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!384 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !385, file: !255, line: 158)
!385 = !DISubprogram(name: "putwchar", scope: !261, file: !261, line: 750, type: !386, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!386 = !DISubroutineType(types: !387)
!387 = !{!257, !329}
!388 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !389, file: !255, line: 160)
!389 = !DISubprogram(name: "swprintf", scope: !261, file: !261, line: 590, type: !390, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!390 = !DISubroutineType(types: !391)
!391 = !{!11, !330, !317, !340, null}
!392 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !393, file: !255, line: 162)
!393 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !261, file: !261, line: 649, type: !394, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!394 = !DISubroutineType(types: !395)
!395 = !{!11, !340, !340, null}
!396 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !397, file: !255, line: 163)
!397 = !DISubprogram(name: "ungetwc", scope: !261, file: !261, line: 773, type: !398, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!398 = !DISubroutineType(types: !399)
!399 = !{!257, !257, !268}
!400 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !401, file: !255, line: 164)
!401 = !DISubprogram(name: "vfwprintf", scope: !261, file: !261, line: 598, type: !402, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!402 = !DISubroutineType(types: !403)
!403 = !{!11, !331, !340, !404}
!404 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !405, size: 64)
!405 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !29, size: 192, flags: DIFlagTypePassByValue, elements: !406, identifier: "_ZTS13__va_list_tag")
!406 = !{!407, !408, !409, !410}
!407 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !405, file: !29, baseType: !36, size: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !405, file: !29, baseType: !36, size: 32, offset: 32)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !405, file: !29, baseType: !40, size: 64, offset: 64)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !405, file: !29, baseType: !40, size: 64, offset: 128)
!411 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !412, file: !255, line: 166)
!412 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !261, file: !261, line: 696, type: !402, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!413 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !414, file: !255, line: 169)
!414 = !DISubprogram(name: "vswprintf", scope: !261, file: !261, line: 611, type: !415, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!415 = !DISubroutineType(types: !416)
!416 = !{!11, !330, !317, !340, !404}
!417 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !418, file: !255, line: 172)
!418 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !261, file: !261, line: 703, type: !419, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!419 = !DISubroutineType(types: !420)
!420 = !{!11, !340, !340, !404}
!421 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !422, file: !255, line: 174)
!422 = !DISubprogram(name: "vwprintf", scope: !261, file: !261, line: 606, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!423 = !DISubroutineType(types: !424)
!424 = !{!11, !340, !404}
!425 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !426, file: !255, line: 176)
!426 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !261, file: !261, line: 700, type: !423, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!427 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !428, file: !255, line: 178)
!428 = !DISubprogram(name: "wcrtomb", scope: !261, file: !261, line: 301, type: !429, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!429 = !DISubroutineType(types: !430)
!430 = !{!317, !431, !329, !364}
!431 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!432 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !433, file: !255, line: 179)
!433 = !DISubprogram(name: "wcscat", scope: !261, file: !261, line: 97, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!434 = !DISubroutineType(types: !435)
!435 = !{!328, !330, !340}
!436 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !437, file: !255, line: 180)
!437 = !DISubprogram(name: "wcscmp", scope: !261, file: !261, line: 106, type: !438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!438 = !DISubroutineType(types: !439)
!439 = !{!11, !341, !341}
!440 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !441, file: !255, line: 181)
!441 = !DISubprogram(name: "wcscoll", scope: !261, file: !261, line: 131, type: !438, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!442 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !443, file: !255, line: 182)
!443 = !DISubprogram(name: "wcscpy", scope: !261, file: !261, line: 87, type: !434, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!444 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !445, file: !255, line: 183)
!445 = !DISubprogram(name: "wcscspn", scope: !261, file: !261, line: 187, type: !446, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!446 = !DISubroutineType(types: !447)
!447 = !{!317, !341, !341}
!448 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !449, file: !255, line: 184)
!449 = !DISubprogram(name: "wcsftime", scope: !261, file: !261, line: 837, type: !450, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!450 = !DISubroutineType(types: !451)
!451 = !{!317, !330, !317, !340, !452}
!452 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !454, size: 64)
!454 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !455)
!455 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !456, line: 7, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!456 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!457 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !458, file: !255, line: 185)
!458 = !DISubprogram(name: "wcslen", scope: !261, file: !261, line: 222, type: !459, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!459 = !DISubroutineType(types: !460)
!460 = !{!317, !341}
!461 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !462, file: !255, line: 186)
!462 = !DISubprogram(name: "wcsncat", scope: !261, file: !261, line: 101, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!463 = !DISubroutineType(types: !464)
!464 = !{!328, !330, !340, !317}
!465 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !466, file: !255, line: 187)
!466 = !DISubprogram(name: "wcsncmp", scope: !261, file: !261, line: 109, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!467 = !DISubroutineType(types: !468)
!468 = !{!11, !341, !341, !317}
!469 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !470, file: !255, line: 188)
!470 = !DISubprogram(name: "wcsncpy", scope: !261, file: !261, line: 92, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!471 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !472, file: !255, line: 189)
!472 = !DISubprogram(name: "wcsrtombs", scope: !261, file: !261, line: 343, type: !473, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!473 = !DISubroutineType(types: !474)
!474 = !{!317, !431, !475, !317, !364}
!475 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !476)
!476 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!477 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !478, file: !255, line: 190)
!478 = !DISubprogram(name: "wcsspn", scope: !261, file: !261, line: 191, type: !446, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!479 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !480, file: !255, line: 191)
!480 = !DISubprogram(name: "wcstod", scope: !261, file: !261, line: 377, type: !481, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!481 = !DISubroutineType(types: !482)
!482 = !{!483, !340, !484}
!483 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!484 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !485)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!486 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !487, file: !255, line: 193)
!487 = !DISubprogram(name: "wcstof", scope: !261, file: !261, line: 382, type: !488, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!488 = !DISubroutineType(types: !489)
!489 = !{!490, !340, !484}
!490 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!491 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !492, file: !255, line: 195)
!492 = !DISubprogram(name: "wcstok", scope: !261, file: !261, line: 217, type: !493, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!493 = !DISubroutineType(types: !494)
!494 = !{!328, !330, !340, !484}
!495 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !496, file: !255, line: 196)
!496 = !DISubprogram(name: "wcstol", scope: !261, file: !261, line: 428, type: !497, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!497 = !DISubroutineType(types: !498)
!498 = !{!88, !340, !484, !11}
!499 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !500, file: !255, line: 197)
!500 = !DISubprogram(name: "wcstoul", scope: !261, file: !261, line: 433, type: !501, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!501 = !DISubroutineType(types: !502)
!502 = !{!53, !340, !484, !11}
!503 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !504, file: !255, line: 198)
!504 = !DISubprogram(name: "wcsxfrm", scope: !261, file: !261, line: 135, type: !505, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!505 = !DISubroutineType(types: !506)
!506 = !{!317, !330, !340, !317}
!507 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !508, file: !255, line: 199)
!508 = !DISubprogram(name: "wctob", scope: !261, file: !261, line: 324, type: !509, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!509 = !DISubroutineType(types: !510)
!510 = !{!11, !257}
!511 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !512, file: !255, line: 200)
!512 = !DISubprogram(name: "wmemcmp", scope: !261, file: !261, line: 258, type: !467, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!513 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !514, file: !255, line: 201)
!514 = !DISubprogram(name: "wmemcpy", scope: !261, file: !261, line: 262, type: !463, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!515 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !516, file: !255, line: 202)
!516 = !DISubprogram(name: "wmemmove", scope: !261, file: !261, line: 267, type: !517, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!517 = !DISubroutineType(types: !518)
!518 = !{!328, !328, !341, !317}
!519 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !520, file: !255, line: 203)
!520 = !DISubprogram(name: "wmemset", scope: !261, file: !261, line: 271, type: !521, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!521 = !DISubroutineType(types: !522)
!522 = !{!328, !328, !329, !317}
!523 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !524, file: !255, line: 204)
!524 = !DISubprogram(name: "wprintf", scope: !261, file: !261, line: 587, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!525 = !DISubroutineType(types: !526)
!526 = !{!11, !340, null}
!527 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !528, file: !255, line: 205)
!528 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !261, file: !261, line: 646, type: !525, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!529 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !530, file: !255, line: 206)
!530 = !DISubprogram(name: "wcschr", scope: !261, file: !261, line: 164, type: !531, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!531 = !DISubroutineType(types: !532)
!532 = !{!328, !341, !329}
!533 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !534, file: !255, line: 207)
!534 = !DISubprogram(name: "wcspbrk", scope: !261, file: !261, line: 201, type: !535, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!535 = !DISubroutineType(types: !536)
!536 = !{!328, !341, !341}
!537 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !538, file: !255, line: 208)
!538 = !DISubprogram(name: "wcsrchr", scope: !261, file: !261, line: 174, type: !531, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!539 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !540, file: !255, line: 209)
!540 = !DISubprogram(name: "wcsstr", scope: !261, file: !261, line: 212, type: !535, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!541 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !542, file: !255, line: 210)
!542 = !DISubprogram(name: "wmemchr", scope: !261, file: !261, line: 253, type: !543, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!543 = !DISubroutineType(types: !544)
!544 = !{!328, !341, !329, !317}
!545 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !546, file: !255, line: 251)
!546 = !DISubprogram(name: "wcstold", scope: !261, file: !261, line: 384, type: !547, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!547 = !DISubroutineType(types: !548)
!548 = !{!549, !340, !484}
!549 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!550 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !551, file: !255, line: 260)
!551 = !DISubprogram(name: "wcstoll", scope: !261, file: !261, line: 441, type: !552, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!552 = !DISubroutineType(types: !553)
!553 = !{!554, !340, !484, !11}
!554 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!555 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !556, file: !255, line: 261)
!556 = !DISubprogram(name: "wcstoull", scope: !261, file: !261, line: 448, type: !557, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!557 = !DISubroutineType(types: !558)
!558 = !{!559, !340, !484, !11}
!559 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !546, file: !255, line: 267)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !551, file: !255, line: 268)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !556, file: !255, line: 269)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !487, file: !255, line: 283)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !412, file: !255, line: 286)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !418, file: !255, line: 289)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !426, file: !255, line: 292)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !546, file: !255, line: 296)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !551, file: !255, line: 297)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !556, file: !255, line: 298)
!570 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !571, file: !572, line: 58)
!571 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !573, file: !572, line: 80, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !574, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!572 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/exception_ptr.h", directory: "")
!573 = !DINamespace(name: "__exception_ptr", scope: !2)
!574 = !{!575, !576, !580, !583, !584, !589, !590, !594, !599, !603, !607, !610, !611, !614, !617}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !571, file: !572, line: 82, baseType: !40, size: 64)
!576 = !DISubprogram(name: "exception_ptr", scope: !571, file: !572, line: 84, type: !577, scopeLine: 84, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!577 = !DISubroutineType(types: !578)
!578 = !{null, !579, !40}
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!580 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !571, file: !572, line: 86, type: !581, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!581 = !DISubroutineType(types: !582)
!582 = !{null, !579}
!583 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !571, file: !572, line: 87, type: !581, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !571, file: !572, line: 89, type: !585, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!585 = !DISubroutineType(types: !586)
!586 = !{!40, !587}
!587 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !588, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!588 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !571)
!589 = !DISubprogram(name: "exception_ptr", scope: !571, file: !572, line: 97, type: !581, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubprogram(name: "exception_ptr", scope: !571, file: !572, line: 99, type: !591, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!591 = !DISubroutineType(types: !592)
!592 = !{null, !579, !593}
!593 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !588, size: 64)
!594 = !DISubprogram(name: "exception_ptr", scope: !571, file: !572, line: 102, type: !595, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!595 = !DISubroutineType(types: !596)
!596 = !{null, !579, !597}
!597 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !2, file: !113, line: 264, baseType: !598)
!598 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!599 = !DISubprogram(name: "exception_ptr", scope: !571, file: !572, line: 106, type: !600, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!600 = !DISubroutineType(types: !601)
!601 = !{null, !579, !602}
!602 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !571, size: 64)
!603 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !571, file: !572, line: 119, type: !604, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!604 = !DISubroutineType(types: !605)
!605 = !{!606, !579, !593}
!606 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !571, size: 64)
!607 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !571, file: !572, line: 123, type: !608, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!608 = !DISubroutineType(types: !609)
!609 = !{!606, !579, !602}
!610 = !DISubprogram(name: "~exception_ptr", scope: !571, file: !572, line: 130, type: !581, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !571, file: !572, line: 133, type: !612, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!612 = !DISubroutineType(types: !613)
!613 = !{null, !579, !606}
!614 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !571, file: !572, line: 145, type: !615, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!615 = !DISubroutineType(types: !616)
!616 = !{!13, !587}
!617 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !571, file: !572, line: 154, type: !618, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!618 = !DISubroutineType(types: !619)
!619 = !{!620, !587}
!620 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !621, size: 64)
!621 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !622)
!622 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !2, file: !623, line: 88, flags: DIFlagFwdDecl, identifier: "_ZTSSt9type_info")
!623 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/typeinfo", directory: "")
!624 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !573, entity: !625, file: !572, line: 74)
!625 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !572, line: 70, type: !626, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!626 = !DISubroutineType(types: !627)
!627 = !{null, !571}
!628 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !629, entity: !630, file: !631, line: 58)
!629 = !DINamespace(name: "__gnu_debug", scope: null)
!630 = !DINamespace(name: "__debug", scope: !2)
!631 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/debug/debug.h", directory: "")
!632 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !633, file: !636, line: 47)
!633 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !634, line: 24, baseType: !635)
!634 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !295, line: 37, baseType: !75)
!636 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cstdint", directory: "")
!637 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !638, file: !636, line: 48)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !634, line: 25, baseType: !639)
!639 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !295, line: 39, baseType: !640)
!640 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!641 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !642, file: !636, line: 49)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !634, line: 26, baseType: !643)
!643 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !295, line: 41, baseType: !11)
!644 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !645, file: !636, line: 50)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !634, line: 27, baseType: !646)
!646 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !295, line: 44, baseType: !88)
!647 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !648, file: !636, line: 52)
!648 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !649, line: 58, baseType: !75)
!649 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!650 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !651, file: !636, line: 53)
!651 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !649, line: 60, baseType: !88)
!652 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !653, file: !636, line: 54)
!653 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !649, line: 61, baseType: !88)
!654 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !655, file: !636, line: 55)
!655 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !649, line: 62, baseType: !88)
!656 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !657, file: !636, line: 57)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !649, line: 43, baseType: !658)
!658 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !295, line: 52, baseType: !635)
!659 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !660, file: !636, line: 58)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !649, line: 44, baseType: !661)
!661 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !295, line: 54, baseType: !639)
!662 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !663, file: !636, line: 59)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !649, line: 45, baseType: !664)
!664 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !295, line: 56, baseType: !643)
!665 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !666, file: !636, line: 60)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !649, line: 46, baseType: !667)
!667 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !295, line: 58, baseType: !646)
!668 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !669, file: !636, line: 62)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !649, line: 101, baseType: !670)
!670 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !295, line: 72, baseType: !88)
!671 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !672, file: !636, line: 63)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !229, line: 267, baseType: !673)
!673 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !295, line: 207, baseType: !88)
!674 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !675, file: !636, line: 65)
!675 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !676, line: 24, baseType: !677)
!676 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!677 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !295, line: 38, baseType: !78)
!678 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !679, file: !636, line: 66)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !676, line: 25, baseType: !680)
!680 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !295, line: 40, baseType: !297)
!681 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !682, file: !636, line: 67)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !676, line: 26, baseType: !683)
!683 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !295, line: 42, baseType: !36)
!684 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !685, file: !636, line: 68)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !676, line: 27, baseType: !686)
!686 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !295, line: 45, baseType: !53)
!687 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !688, file: !636, line: 70)
!688 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !649, line: 71, baseType: !78)
!689 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !690, file: !636, line: 71)
!690 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !649, line: 73, baseType: !53)
!691 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !692, file: !636, line: 72)
!692 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !649, line: 74, baseType: !53)
!693 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !694, file: !636, line: 73)
!694 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !649, line: 75, baseType: !53)
!695 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !696, file: !636, line: 75)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !649, line: 49, baseType: !697)
!697 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !295, line: 53, baseType: !677)
!698 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !699, file: !636, line: 76)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !649, line: 50, baseType: !700)
!700 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !295, line: 55, baseType: !680)
!701 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !702, file: !636, line: 77)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !649, line: 51, baseType: !703)
!703 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !295, line: 57, baseType: !683)
!704 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !705, file: !636, line: 78)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !649, line: 52, baseType: !706)
!706 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !295, line: 59, baseType: !686)
!707 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !708, file: !636, line: 80)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !649, line: 102, baseType: !709)
!709 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !295, line: 73, baseType: !53)
!710 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !711, file: !636, line: 81)
!711 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !649, line: 90, baseType: !53)
!712 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !713, file: !715, line: 53)
!713 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !714, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!714 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!715 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/clocale", directory: "")
!716 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !717, file: !715, line: 54)
!717 = !DISubprogram(name: "setlocale", scope: !714, file: !714, line: 122, type: !718, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!718 = !DISubroutineType(types: !719)
!719 = !{!106, !11, !45}
!720 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !721, file: !715, line: 55)
!721 = !DISubprogram(name: "localeconv", scope: !714, file: !714, line: 125, type: !722, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!722 = !DISubroutineType(types: !723)
!723 = !{!724}
!724 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !713, size: 64)
!725 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !726, file: !730, line: 64)
!726 = !DISubprogram(name: "isalnum", scope: !727, file: !727, line: 108, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!727 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!728 = !DISubroutineType(types: !729)
!729 = !{!11, !11}
!730 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cctype", directory: "")
!731 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !732, file: !730, line: 65)
!732 = !DISubprogram(name: "isalpha", scope: !727, file: !727, line: 109, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!733 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !734, file: !730, line: 66)
!734 = !DISubprogram(name: "iscntrl", scope: !727, file: !727, line: 110, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!735 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !736, file: !730, line: 67)
!736 = !DISubprogram(name: "isdigit", scope: !727, file: !727, line: 111, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!737 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !738, file: !730, line: 68)
!738 = !DISubprogram(name: "isgraph", scope: !727, file: !727, line: 113, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!739 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !740, file: !730, line: 69)
!740 = !DISubprogram(name: "islower", scope: !727, file: !727, line: 112, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!741 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !742, file: !730, line: 70)
!742 = !DISubprogram(name: "isprint", scope: !727, file: !727, line: 114, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!743 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !744, file: !730, line: 71)
!744 = !DISubprogram(name: "ispunct", scope: !727, file: !727, line: 115, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!745 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !746, file: !730, line: 72)
!746 = !DISubprogram(name: "isspace", scope: !727, file: !727, line: 116, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!747 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !748, file: !730, line: 73)
!748 = !DISubprogram(name: "isupper", scope: !727, file: !727, line: 117, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!749 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !750, file: !730, line: 74)
!750 = !DISubprogram(name: "isxdigit", scope: !727, file: !727, line: 118, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!751 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !752, file: !730, line: 75)
!752 = !DISubprogram(name: "tolower", scope: !727, file: !727, line: 122, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!753 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !754, file: !730, line: 76)
!754 = !DISubprogram(name: "toupper", scope: !727, file: !727, line: 125, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!755 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !756, file: !730, line: 87)
!756 = !DISubprogram(name: "isblank", scope: !727, file: !727, line: 130, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!757 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !758, file: !760, line: 52)
!758 = !DISubprogram(name: "abs", scope: !759, file: !759, line: 840, type: !728, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!759 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!760 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/std_abs.h", directory: "")
!761 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !762, file: !764, line: 127)
!762 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !759, line: 62, baseType: !763)
!763 = !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!764 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cstdlib", directory: "")
!765 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !766, file: !764, line: 128)
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !759, line: 70, baseType: !767)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !768, identifier: "_ZTS6ldiv_t")
!768 = !{!769, !770}
!769 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !767, file: !759, line: 68, baseType: !88, size: 64)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !767, file: !759, line: 69, baseType: !88, size: 64, offset: 64)
!771 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !772, file: !764, line: 130)
!772 = !DISubprogram(name: "abort", scope: !759, file: !759, line: 591, type: !773, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!773 = !DISubroutineType(types: !774)
!774 = !{null}
!775 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !776, file: !764, line: 134)
!776 = !DISubprogram(name: "atexit", scope: !759, file: !759, line: 595, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!777 = !DISubroutineType(types: !778)
!778 = !{!11, !779}
!779 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !773, size: 64)
!780 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !781, file: !764, line: 137)
!781 = !DISubprogram(name: "at_quick_exit", scope: !759, file: !759, line: 600, type: !777, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!782 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !783, file: !764, line: 140)
!783 = !DISubprogram(name: "atof", scope: !784, file: !784, line: 25, type: !785, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!784 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "")
!785 = !DISubroutineType(types: !786)
!786 = !{!483, !45}
!787 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !788, file: !764, line: 141)
!788 = !DISubprogram(name: "atoi", scope: !759, file: !759, line: 361, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!789 = !DISubroutineType(types: !790)
!790 = !{!11, !45}
!791 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !792, file: !764, line: 142)
!792 = !DISubprogram(name: "atol", scope: !759, file: !759, line: 366, type: !793, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!793 = !DISubroutineType(types: !794)
!794 = !{!88, !45}
!795 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !796, file: !764, line: 143)
!796 = !DISubprogram(name: "bsearch", scope: !797, file: !797, line: 20, type: !798, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!797 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "")
!798 = !DISubroutineType(types: !799)
!799 = !{!40, !118, !118, !317, !317, !800}
!800 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !759, line: 808, baseType: !801)
!801 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !802, size: 64)
!802 = !DISubroutineType(types: !803)
!803 = !{!11, !118, !118}
!804 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !805, file: !764, line: 144)
!805 = !DISubprogram(name: "calloc", scope: !759, file: !759, line: 542, type: !806, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!806 = !DISubroutineType(types: !807)
!807 = !{!40, !317, !317}
!808 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !809, file: !764, line: 145)
!809 = !DISubprogram(name: "div", scope: !759, file: !759, line: 852, type: !810, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!810 = !DISubroutineType(types: !811)
!811 = !{!762, !11, !11}
!812 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !813, file: !764, line: 146)
!813 = !DISubprogram(name: "exit", scope: !759, file: !759, line: 617, type: !814, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!814 = !DISubroutineType(types: !815)
!815 = !{null, !11}
!816 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !817, file: !764, line: 147)
!817 = !DISubprogram(name: "free", scope: !759, file: !759, line: 565, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!818 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !819, file: !764, line: 148)
!819 = !DISubprogram(name: "getenv", scope: !759, file: !759, line: 634, type: !820, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!820 = !DISubroutineType(types: !821)
!821 = !{!106, !45}
!822 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !823, file: !764, line: 149)
!823 = !DISubprogram(name: "labs", scope: !759, file: !759, line: 841, type: !824, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!824 = !DISubroutineType(types: !825)
!825 = !{!88, !88}
!826 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !827, file: !764, line: 150)
!827 = !DISubprogram(name: "ldiv", scope: !759, file: !759, line: 854, type: !828, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!828 = !DISubroutineType(types: !829)
!829 = !{!766, !88, !88}
!830 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !831, file: !764, line: 151)
!831 = !DISubprogram(name: "malloc", scope: !759, file: !759, line: 539, type: !832, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!832 = !DISubroutineType(types: !833)
!833 = !{!40, !317}
!834 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !835, file: !764, line: 153)
!835 = !DISubprogram(name: "mblen", scope: !759, file: !759, line: 922, type: !836, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!836 = !DISubroutineType(types: !837)
!837 = !{!11, !45, !317}
!838 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !839, file: !764, line: 154)
!839 = !DISubprogram(name: "mbstowcs", scope: !759, file: !759, line: 933, type: !840, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!840 = !DISubroutineType(types: !841)
!841 = !{!317, !330, !363, !317}
!842 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !843, file: !764, line: 155)
!843 = !DISubprogram(name: "mbtowc", scope: !759, file: !759, line: 925, type: !844, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!844 = !DISubroutineType(types: !845)
!845 = !{!11, !330, !363, !317}
!846 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !847, file: !764, line: 157)
!847 = !DISubprogram(name: "qsort", scope: !759, file: !759, line: 830, type: !848, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!848 = !DISubroutineType(types: !849)
!849 = !{null, !40, !317, !317, !800}
!850 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !851, file: !764, line: 160)
!851 = !DISubprogram(name: "quick_exit", scope: !759, file: !759, line: 623, type: !814, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!852 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !853, file: !764, line: 163)
!853 = !DISubprogram(name: "rand", scope: !759, file: !759, line: 453, type: !854, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!854 = !DISubroutineType(types: !855)
!855 = !{!11}
!856 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !857, file: !764, line: 164)
!857 = !DISubprogram(name: "realloc", scope: !759, file: !759, line: 550, type: !858, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!858 = !DISubroutineType(types: !859)
!859 = !{!40, !40, !317}
!860 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !861, file: !764, line: 165)
!861 = !DISubprogram(name: "srand", scope: !759, file: !759, line: 455, type: !862, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!862 = !DISubroutineType(types: !863)
!863 = !{null, !36}
!864 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !865, file: !764, line: 166)
!865 = !DISubprogram(name: "strtod", scope: !759, file: !759, line: 117, type: !866, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!866 = !DISubroutineType(types: !867)
!867 = !{!483, !363, !868}
!868 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !869)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!870 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !871, file: !764, line: 167)
!871 = !DISubprogram(name: "strtol", scope: !759, file: !759, line: 176, type: !872, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!872 = !DISubroutineType(types: !873)
!873 = !{!88, !363, !868, !11}
!874 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !875, file: !764, line: 168)
!875 = !DISubprogram(name: "strtoul", scope: !759, file: !759, line: 180, type: !876, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!876 = !DISubroutineType(types: !877)
!877 = !{!53, !363, !868, !11}
!878 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !879, file: !764, line: 169)
!879 = !DISubprogram(name: "system", scope: !759, file: !759, line: 784, type: !789, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!880 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !881, file: !764, line: 171)
!881 = !DISubprogram(name: "wcstombs", scope: !759, file: !759, line: 937, type: !882, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!882 = !DISubroutineType(types: !883)
!883 = !{!317, !431, !340, !317}
!884 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !885, file: !764, line: 172)
!885 = !DISubprogram(name: "wctomb", scope: !759, file: !759, line: 929, type: !886, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!886 = !DISubroutineType(types: !887)
!887 = !{!11, !106, !329}
!888 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !889, file: !764, line: 200)
!889 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !759, line: 80, baseType: !890)
!890 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !759, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !891, identifier: "_ZTS7lldiv_t")
!891 = !{!892, !893}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !890, file: !759, line: 78, baseType: !554, size: 64)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !890, file: !759, line: 79, baseType: !554, size: 64, offset: 64)
!894 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !895, file: !764, line: 206)
!895 = !DISubprogram(name: "_Exit", scope: !759, file: !759, line: 629, type: !814, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!896 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !897, file: !764, line: 210)
!897 = !DISubprogram(name: "llabs", scope: !759, file: !759, line: 844, type: !898, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!898 = !DISubroutineType(types: !899)
!899 = !{!554, !554}
!900 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !901, file: !764, line: 216)
!901 = !DISubprogram(name: "lldiv", scope: !759, file: !759, line: 858, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!902 = !DISubroutineType(types: !903)
!903 = !{!889, !554, !554}
!904 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !905, file: !764, line: 227)
!905 = !DISubprogram(name: "atoll", scope: !759, file: !759, line: 373, type: !906, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!906 = !DISubroutineType(types: !907)
!907 = !{!554, !45}
!908 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !909, file: !764, line: 228)
!909 = !DISubprogram(name: "strtoll", scope: !759, file: !759, line: 200, type: !910, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!910 = !DISubroutineType(types: !911)
!911 = !{!554, !363, !868, !11}
!912 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !913, file: !764, line: 229)
!913 = !DISubprogram(name: "strtoull", scope: !759, file: !759, line: 205, type: !914, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!914 = !DISubroutineType(types: !915)
!915 = !{!559, !363, !868, !11}
!916 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !917, file: !764, line: 231)
!917 = !DISubprogram(name: "strtof", scope: !759, file: !759, line: 123, type: !918, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!918 = !DISubroutineType(types: !919)
!919 = !{!490, !363, !868}
!920 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !921, file: !764, line: 232)
!921 = !DISubprogram(name: "strtold", scope: !759, file: !759, line: 126, type: !922, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!922 = !DISubroutineType(types: !923)
!923 = !{!549, !363, !868}
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !889, file: !764, line: 240)
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !895, file: !764, line: 242)
!926 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !897, file: !764, line: 244)
!927 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !928, file: !764, line: 245)
!928 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !96, file: !764, line: 213, type: !902, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !901, file: !764, line: 246)
!930 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !905, file: !764, line: 248)
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !917, file: !764, line: 249)
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !909, file: !764, line: 250)
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !913, file: !764, line: 251)
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !921, file: !764, line: 252)
!935 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !936, file: !938, line: 98)
!936 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !937, line: 7, baseType: !271)
