; ModuleID = 'integration/pthreadrace/pthread-rwlock-yes.cpp'
source_filename = "integration/pthreadrace/pthread-rwlock-yes.cpp"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"class.std::ios_base::Init" = type { i8 }
%"class.std::basic_ostream" = type { i32 (...)**, %"class.std::basic_ios" }
%"class.std::basic_ios" = type { %"class.std::ios_base", %"class.std::basic_ostream"*, i8, i8, %"class.std::basic_streambuf"*, %"class.std::ctype"*, %"class.std::num_put"*, %"class.std::num_get"* }
%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
%"struct.std::ios_base::_Words" = type { i8*, i64 }
%"class.std::locale" = type { %"class.std::locale::_Impl"* }
%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
%"class.std::basic_streambuf" = type { i32 (...)**, i8*, i8*, i8*, i8*, i8*, i8*, %"class.std::locale" }

!4 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "Init", scope: !6, file: !5, line: 603, size: 8, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !7, identifier: "_ZTSNSt8ios_base4InitE")
!5 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/ios_base.h", directory: "")
!6 = !DICompositeType(tag: DW_TAG_class_type, name: "ios_base", scope: !2, file: !5, line: 228, flags: DIFlagFwdDecl, identifier: "_ZTSSt8ios_base")
!7 = !{!8, !12, !14, !18, !19, !24}
!8 = !DIDerivedType(tag: DW_TAG_member, name: "_S_refcount", scope: !4, file: !5, line: 616, baseType: !9, flags: DIFlagStaticMember)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "_Atomic_word", file: !10, line: 32, baseType: !11)
!10 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/x86_64-pc-linux-gnu/bits/atomic_word.h", directory: "")
!11 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "_S_synced_with_stdio", scope: !4, file: !5, line: 617, baseType: !13, flags: DIFlagStaticMember)
!13 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!14 = !DISubprogram(name: "Init", scope: !4, file: !5, line: 607, type: !15, scopeLine: 607, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!15 = !DISubroutineType(types: !16)
!16 = !{null, !17}
!17 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !4, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!18 = !DISubprogram(name: "~Init", scope: !4, file: !5, line: 608, type: !15, scopeLine: 608, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!19 = !DISubprogram(name: "Init", scope: !4, file: !5, line: 611, type: !20, scopeLine: 611, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!20 = !DISubroutineType(types: !21)
!21 = !{null, !17, !22}
!22 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !23, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!24 = !DISubprogram(name: "operator=", linkageName: "_ZNSt8ios_base4InitaSERKS0_", scope: !4, file: !5, line: 612, type: !25, scopeLine: 612, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!25 = !DISubroutineType(types: !26)
!26 = !{!27, !17, !22}
!27 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !4, size: 64)
!28 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus_14, file: !29, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !30, retainedTypes: !39, globals: !236, imports: !237, splitDebugInlining: false, nameTableKind: None)
!29 = !DIFile(filename: "integration/pthreadrace/pthread-rwlock-yes.cpp", directory: "/home/brad/Code/OpenRace/tests/data")
!30 = !{!31}
!31 = !DICompositeType(tag: DW_TAG_enumeration_type, scope: !33, file: !32, line: 169, baseType: !36, size: 32, elements: !37, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEUt_E")
!32 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/basic_string.h", directory: "")
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "basic_string<char, std::char_traits<char>, std::allocator<char> >", scope: !35, file: !34, line: 1618, flags: DIFlagFwdDecl, identifier: "_ZTSNSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE")
!34 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/basic_string.tcc", directory: "")
!35 = !DINamespace(name: "__cxx11", scope: !2, exportSymbols: true)
!36 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!37 = !{!38}
!38 = !DIEnumerator(name: "_S_local_capacity", value: 15, isUnsigned: true)
!39 = !{!40, !41, !49, !55, !92, !152, !204, !208, !228, !232, !235, !78, !33}
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!41 = !DISubprogram(name: "perror", scope: !42, file: !42, line: 780, type: !43, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!42 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!43 = !DISubroutineType(types: !44)
!44 = !{null, !45}
!45 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !46, size: 64)
!46 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!47 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!48 = !{}
!49 = !DISubprogram(name: "pthread_join", scope: !50, file: !50, line: 217, type: !51, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!50 = !DIFile(filename: "/usr/include/pthread.h", directory: "")
!51 = !DISubroutineType(types: !52)
!52 = !{!11, !53, !54}
!53 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !40, size: 64)
!55 = !DISubprogram(name: "pthread_rwlock_init", scope: !50, file: !50, line: 904, type: !56, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!56 = !DISubroutineType(types: !57)
!57 = !{!11, !58, !89}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !59, size: 64)
!59 = distinct !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 86, size: 448, flags: DIFlagTypePassByValue, elements: !61, identifier: "_ZTS16pthread_rwlock_t")
!60 = !DIFile(filename: "/usr/include/bits/pthreadtypes.h", directory: "")
!61 = !{!62, !83, !87}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "__data", scope: !59, file: !60, line: 88, baseType: !63, size: 448)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__pthread_rwlock_arch_t", file: !64, line: 23, size: 448, flags: DIFlagTypePassByValue, elements: !65, identifier: "_ZTS23__pthread_rwlock_arch_t")
!64 = !DIFile(filename: "/usr/include/bits/struct_rwlock.h", directory: "")
!65 = !{!66, !67, !68, !69, !70, !71, !72, !73, !74, !76, !81, !82}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "__readers", scope: !63, file: !64, line: 25, baseType: !36, size: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__writers", scope: !63, file: !64, line: 26, baseType: !36, size: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__wrphase_futex", scope: !63, file: !64, line: 27, baseType: !36, size: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "__writers_futex", scope: !63, file: !64, line: 28, baseType: !36, size: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "__pad3", scope: !63, file: !64, line: 29, baseType: !36, size: 32, offset: 128)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "__pad4", scope: !63, file: !64, line: 30, baseType: !36, size: 32, offset: 160)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "__cur_writer", scope: !63, file: !64, line: 32, baseType: !11, size: 32, offset: 192)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__shared", scope: !63, file: !64, line: 33, baseType: !11, size: 32, offset: 224)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__rwelision", scope: !63, file: !64, line: 34, baseType: !75, size: 8, offset: 256)
!75 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__pad1", scope: !63, file: !64, line: 39, baseType: !77, size: 56, offset: 264)
!77 = !DICompositeType(tag: DW_TAG_array_type, baseType: !78, size: 56, elements: !79)
!78 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!79 = !{!80}
!80 = !DISubrange(count: 7)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "__pad2", scope: !63, file: !64, line: 42, baseType: !53, size: 64, offset: 320)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "__flags", scope: !63, file: !64, line: 45, baseType: !36, size: 32, offset: 384)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__size", scope: !59, file: !60, line: 89, baseType: !84, size: 448)
!84 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 448, elements: !85)
!85 = !{!86}
!86 = !DISubrange(count: 56)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "__align", scope: !59, file: !60, line: 90, baseType: !88, size: 64)
!88 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !91)
!91 = !DICompositeType(tag: DW_TAG_union_type, file: !60, line: 93, flags: DIFlagFwdDecl, identifier: "_ZTS20pthread_rwlockattr_t")
!92 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !33, file: !32, line: 88, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !95, file: !94, line: 59, baseType: !126)
!94 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/ext/alloc_traits.h", directory: "")
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__alloc_traits<std::allocator<char>, char>", scope: !96, file: !94, line: 48, size: 8, flags: DIFlagTypePassByValue, elements: !97, templateParams: !150, identifier: "_ZTSN9__gnu_cxx14__alloc_traitsISaIcEcEE")
!96 = !DINamespace(name: "__gnu_cxx", scope: null)
!97 = !{!98, !134, !139, !143, !146, !147, !148, !149}
!98 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !95, baseType: !99, extraData: i32 0)
!99 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "allocator_traits<std::allocator<char> >", scope: !2, file: !100, line: 407, size: 8, flags: DIFlagTypePassByValue, elements: !101, templateParams: !132, identifier: "_ZTSSt16allocator_traitsISaIcEE")
!100 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/alloc_traits.h", directory: "")
!101 = !{!102, !114, !120, !123, !129}
!102 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_m", scope: !99, file: !100, line: 459, type: !103, scopeLine: 459, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!103 = !DISubroutineType(types: !104)
!104 = !{!105, !107, !111}
!105 = !DIDerivedType(tag: DW_TAG_typedef, name: "pointer", scope: !99, file: !100, line: 416, baseType: !106)
!106 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !108, size: 64)
!108 = !DIDerivedType(tag: DW_TAG_typedef, name: "allocator_type", scope: !99, file: !100, line: 410, baseType: !109)
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "allocator<char>", scope: !2, file: !110, line: 249, flags: DIFlagFwdDecl, identifier: "_ZTSSaIcE")
!110 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/allocator.h", directory: "")
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", file: !100, line: 431, baseType: !112)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", scope: !2, file: !113, line: 260, baseType: !53)
!113 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/x86_64-pc-linux-gnu/bits/c++config.h", directory: "")
!114 = !DISubprogram(name: "allocate", linkageName: "_ZNSt16allocator_traitsISaIcEE8allocateERS0_mPKv", scope: !99, file: !100, line: 473, type: !115, scopeLine: 473, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!115 = !DISubroutineType(types: !116)
!116 = !{!105, !107, !111, !117}
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "const_void_pointer", file: !100, line: 425, baseType: !118)
!118 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !119, size: 64)
!119 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!120 = !DISubprogram(name: "deallocate", linkageName: "_ZNSt16allocator_traitsISaIcEE10deallocateERS0_Pcm", scope: !99, file: !100, line: 491, type: !121, scopeLine: 491, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!121 = !DISubroutineType(types: !122)
!122 = !{null, !107, !105, !111}
!123 = !DISubprogram(name: "max_size", linkageName: "_ZNSt16allocator_traitsISaIcEE8max_sizeERKS0_", scope: !99, file: !100, line: 543, type: !124, scopeLine: 543, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!124 = !DISubroutineType(types: !125)
!125 = !{!126, !127}
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_type", scope: !99, file: !100, line: 431, baseType: !112)
!127 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !128, size: 64)
!128 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !108)
!129 = !DISubprogram(name: "select_on_container_copy_construction", linkageName: "_ZNSt16allocator_traitsISaIcEE37select_on_container_copy_constructionERKS0_", scope: !99, file: !100, line: 558, type: !130, scopeLine: 558, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!130 = !DISubroutineType(types: !131)
!131 = !{!108, !127}
!132 = !{!133}
!133 = !DITemplateTypeParameter(name: "_Alloc", type: !109)
!134 = !DISubprogram(name: "_S_select_on_copy", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE17_S_select_on_copyERKS1_", scope: !95, file: !94, line: 97, type: !135, scopeLine: 97, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!135 = !DISubroutineType(types: !136)
!136 = !{!109, !137}
!137 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !138, size: 64)
!138 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !109)
!139 = !DISubprogram(name: "_S_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE10_S_on_swapERS1_S3_", scope: !95, file: !94, line: 100, type: !140, scopeLine: 100, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!140 = !DISubroutineType(types: !141)
!141 = !{null, !142, !142}
!142 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !109, size: 64)
!143 = !DISubprogram(name: "_S_propagate_on_copy_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_copy_assignEv", scope: !95, file: !94, line: 103, type: !144, scopeLine: 103, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!144 = !DISubroutineType(types: !145)
!145 = !{!13}
!146 = !DISubprogram(name: "_S_propagate_on_move_assign", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE27_S_propagate_on_move_assignEv", scope: !95, file: !94, line: 106, type: !144, scopeLine: 106, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!147 = !DISubprogram(name: "_S_propagate_on_swap", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE20_S_propagate_on_swapEv", scope: !95, file: !94, line: 109, type: !144, scopeLine: 109, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!148 = !DISubprogram(name: "_S_always_equal", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_always_equalEv", scope: !95, file: !94, line: 112, type: !144, scopeLine: 112, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!149 = !DISubprogram(name: "_S_nothrow_move", linkageName: "_ZN9__gnu_cxx14__alloc_traitsISaIcEcE15_S_nothrow_moveEv", scope: !95, file: !94, line: 115, type: !144, scopeLine: 115, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!150 = !{!133, !151}
!151 = !DITemplateTypeParameter(type: !47)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64)
!153 = !DIDerivedType(tag: DW_TAG_typedef, name: "char_type", scope: !155, file: !154, line: 311, baseType: !47)
!154 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/char_traits.h", directory: "")
!155 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "char_traits<char>", scope: !2, file: !154, line: 309, size: 8, flags: DIFlagTypePassByValue, elements: !156, templateParams: !202, identifier: "_ZTSSt11char_traitsIcE")
!156 = !{!157, !163, !166, !167, !171, !174, !177, !180, !181, !184, !190, !193, !196, !199}
!157 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignERcRKc", scope: !155, file: !154, line: 321, type: !158, scopeLine: 321, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!158 = !DISubroutineType(types: !159)
!159 = !{null, !160, !161}
!160 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !153, size: 64)
!161 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !162, size: 64)
!162 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!163 = !DISubprogram(name: "eq", linkageName: "_ZNSt11char_traitsIcE2eqERKcS2_", scope: !155, file: !154, line: 325, type: !164, scopeLine: 325, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!164 = !DISubroutineType(types: !165)
!165 = !{!13, !161, !161}
!166 = !DISubprogram(name: "lt", linkageName: "_ZNSt11char_traitsIcE2ltERKcS2_", scope: !155, file: !154, line: 329, type: !164, scopeLine: 329, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!167 = !DISubprogram(name: "compare", linkageName: "_ZNSt11char_traitsIcE7compareEPKcS2_m", scope: !155, file: !154, line: 337, type: !168, scopeLine: 337, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!168 = !DISubroutineType(types: !169)
!169 = !{!11, !170, !170, !112}
!170 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !162, size: 64)
!171 = !DISubprogram(name: "length", linkageName: "_ZNSt11char_traitsIcE6lengthEPKc", scope: !155, file: !154, line: 351, type: !172, scopeLine: 351, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!172 = !DISubroutineType(types: !173)
!173 = !{!112, !170}
!174 = !DISubprogram(name: "find", linkageName: "_ZNSt11char_traitsIcE4findEPKcmRS1_", scope: !155, file: !154, line: 361, type: !175, scopeLine: 361, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!175 = !DISubroutineType(types: !176)
!176 = !{!170, !170, !112, !161}
!177 = !DISubprogram(name: "move", linkageName: "_ZNSt11char_traitsIcE4moveEPcPKcm", scope: !155, file: !154, line: 375, type: !178, scopeLine: 375, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!178 = !DISubroutineType(types: !179)
!179 = !{!152, !152, !170, !112}
!180 = !DISubprogram(name: "copy", linkageName: "_ZNSt11char_traitsIcE4copyEPcPKcm", scope: !155, file: !154, line: 387, type: !178, scopeLine: 387, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!181 = !DISubprogram(name: "assign", linkageName: "_ZNSt11char_traitsIcE6assignEPcmc", scope: !155, file: !154, line: 399, type: !182, scopeLine: 399, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!182 = !DISubroutineType(types: !183)
!183 = !{!152, !152, !112, !153}
!184 = !DISubprogram(name: "to_char_type", linkageName: "_ZNSt11char_traitsIcE12to_char_typeERKi", scope: !155, file: !154, line: 411, type: !185, scopeLine: 411, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!185 = !DISubroutineType(types: !186)
!186 = !{!153, !187}
!187 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !188, size: 64)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !189)
!189 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_type", scope: !155, file: !154, line: 312, baseType: !11)
!190 = !DISubprogram(name: "to_int_type", linkageName: "_ZNSt11char_traitsIcE11to_int_typeERKc", scope: !155, file: !154, line: 417, type: !191, scopeLine: 417, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!191 = !DISubroutineType(types: !192)
!192 = !{!189, !161}
!193 = !DISubprogram(name: "eq_int_type", linkageName: "_ZNSt11char_traitsIcE11eq_int_typeERKiS2_", scope: !155, file: !154, line: 421, type: !194, scopeLine: 421, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!194 = !DISubroutineType(types: !195)
!195 = !{!13, !187, !187}
!196 = !DISubprogram(name: "eof", linkageName: "_ZNSt11char_traitsIcE3eofEv", scope: !155, file: !154, line: 425, type: !197, scopeLine: 425, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!197 = !DISubroutineType(types: !198)
!198 = !{!189}
!199 = !DISubprogram(name: "not_eof", linkageName: "_ZNSt11char_traitsIcE7not_eofERKi", scope: !155, file: !154, line: 429, type: !200, scopeLine: 429, flags: DIFlagPrototyped | DIFlagStaticMember, spFlags: DISPFlagOptimized)
!200 = !DISubroutineType(types: !201)
!201 = !{!189, !187}
!202 = !{!203}
!203 = !DITemplateTypeParameter(name: "_CharT", type: !47)
!204 = !DISubprogram(name: "operator delete", linkageName: "_ZdlPv", scope: !205, file: !205, line: 130, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!205 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/new", directory: "")
!206 = !DISubroutineType(types: !207)
!207 = !{null, !40}
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "BulletinRWLock", file: !29, line: 12, size: 704, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !210, identifier: "_ZTS14BulletinRWLock")
!210 = !{!211, !213, !216, !220, !221, !224}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "rwlock_", scope: !209, file: !29, line: 14, baseType: !212, size: 448)
!212 = !DIDerivedType(tag: DW_TAG_typedef, name: "pthread_rwlock_t", file: !60, line: 91, baseType: !59)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "message_", scope: !209, file: !29, line: 15, baseType: !214, size: 256, offset: 448)
!214 = !DIDerivedType(tag: DW_TAG_typedef, name: "string", scope: !2, file: !215, line: 79, baseType: !33)
!215 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/stringfwd.h", directory: "")
!216 = !DISubprogram(name: "BulletinRWLock", scope: !209, file: !29, line: 18, type: !217, scopeLine: 18, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!217 = !DISubroutineType(types: !218)
!218 = !{null, !219}
!219 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!220 = !DISubprogram(name: "~BulletinRWLock", scope: !209, file: !29, line: 20, type: !217, scopeLine: 20, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!221 = !DISubprogram(name: "Read", linkageName: "_ZN14BulletinRWLock4ReadB5cxx11Ev", scope: !209, file: !29, line: 22, type: !222, scopeLine: 22, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!222 = !DISubroutineType(types: !223)
!223 = !{!214, !219}
!224 = !DISubprogram(name: "Update", linkageName: "_ZN14BulletinRWLock6UpdateENSt7__cxx1112basic_stringIcSt11char_traitsIcESaIcEEE", scope: !209, file: !29, line: 28, type: !225, scopeLine: 28, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!225 = !DISubroutineType(types: !226)
!226 = !{null, !219, !227}
!227 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !214)
!228 = !DISubprogram(name: "sleep", scope: !229, file: !229, line: 453, type: !230, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!229 = !DIFile(filename: "/usr/include/unistd.h", directory: "")
!230 = !DISubroutineType(types: !231)
!231 = !{!36, !36}
!232 = !DISubprogram(name: "pthread_rwlock_wrlock", scope: !50, file: !50, line: 935, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!233 = !DISubroutineType(types: !234)
!234 = !{!11, !58}
!235 = !DISubprogram(name: "pthread_rwlock_unlock", scope: !50, file: !50, line: 957, type: !233, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !48)
!236 = !{!0}
!237 = !{!238, !255, !258, !263, !323, !331, !335, !342, !346, !350, !352, !354, !358, !365, !369, !375, !381, !383, !387, !391, !395, !399, !410, !412, !416, !420, !424, !426, !431, !435, !439, !441, !443, !447, !456, !460, !464, !468, !470, !476, !478, !485, !490, !494, !498, !502, !506, !510, !512, !514, !518, !522, !526, !528, !532, !536, !538, !540, !544, !549, !554, !559, !560, !561, !562, !563, !564, !565, !566, !567, !568, !569, !623, !627, !631, !636, !640, !643, !646, !649, !651, !653, !655, !658, !661, !664, !667, !670, !673, !677, !680, !683, !686, !688, !690, !692, !694, !697, !700, !703, !706, !709, !711, !715, !719, !724, !730, !732, !734, !736, !738, !740, !742, !744, !746, !748, !750, !752, !754, !756, !760, !764, !770, !774, !779, !781, !786, !790, !794, !803, !807, !811, !815, !817, !821, !825, !829, !833, !837, !841, !845, !849, !851, !855, !859, !863, !869, !873, !877, !879, !883, !887, !893, !895, !899, !903, !907, !911, !915, !919, !923, !924, !925, !926, !928, !929, !930, !931, !932, !933, !934, !938, !943, !948, !952, !954, !956, !958, !960, !967, !971, !975, !979, !983, !987, !992, !996, !998, !1002, !1008, !1012, !1017, !1019, !1022, !1024, !1028, !1030, !1032, !1034, !1036, !1040, !1042, !1044, !1048, !1052, !1056, !1060, !1064, !1068, !1070, !1074, !1078, !1082, !1086, !1088, !1090, !1094, !1098, !1099, !1100, !1101, !1102, !1103, !1109, !1112, !1113, !1115, !1117, !1119, !1121, !1125, !1127, !1129, !1131, !1133, !1135, !1137, !1139, !1141, !1145, !1149, !1151, !1155}
!238 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !239, file: !254, line: 64)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "mbstate_t", file: !240, line: 6, baseType: !241)
!240 = !DIFile(filename: "/usr/include/bits/types/mbstate_t.h", directory: "")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !242, line: 21, baseType: !243)
!242 = !DIFile(filename: "/usr/include/bits/types/__mbstate_t.h", directory: "")
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !242, line: 13, size: 64, flags: DIFlagTypePassByValue, elements: !244, identifier: "_ZTS11__mbstate_t")
!244 = !{!245, !246}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__count", scope: !243, file: !242, line: 15, baseType: !11, size: 32)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__value", scope: !243, file: !242, line: 20, baseType: !247, size: 32, offset: 32)
!247 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !243, file: !242, line: 16, size: 32, flags: DIFlagTypePassByValue, elements: !248, identifier: "_ZTSN11__mbstate_tUt_E")
!248 = !{!249, !250}
!249 = !DIDerivedType(tag: DW_TAG_member, name: "__wch", scope: !247, file: !242, line: 18, baseType: !36, size: 32)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "__wchb", scope: !247, file: !242, line: 19, baseType: !251, size: 32)
!251 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 32, elements: !252)
!252 = !{!253}
!253 = !DISubrange(count: 4)
!254 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cwchar", directory: "")
!255 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !256, file: !254, line: 141)
!256 = !DIDerivedType(tag: DW_TAG_typedef, name: "wint_t", file: !257, line: 20, baseType: !36)
!257 = !DIFile(filename: "/usr/include/bits/types/wint_t.h", directory: "")
!258 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !259, file: !254, line: 143)
!259 = !DISubprogram(name: "btowc", scope: !260, file: !260, line: 318, type: !261, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!260 = !DIFile(filename: "/usr/include/wchar.h", directory: "")
!261 = !DISubroutineType(types: !262)
!262 = !{!256, !11}
!263 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !264, file: !254, line: 144)
!264 = !DISubprogram(name: "fgetwc", scope: !260, file: !260, line: 729, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!265 = !DISubroutineType(types: !266)
!266 = !{!256, !267}
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64)
!268 = !DIDerivedType(tag: DW_TAG_typedef, name: "__FILE", file: !269, line: 5, baseType: !270)
!269 = !DIFile(filename: "/usr/include/bits/types/__FILE.h", directory: "")
!270 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !271, line: 49, size: 1728, flags: DIFlagTypePassByValue, elements: !272, identifier: "_ZTS8_IO_FILE")
!271 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!272 = !{!273, !274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !288, !290, !291, !292, !295, !297, !298, !302, !305, !307, !310, !313, !314, !315, !318, !319}
!273 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !270, file: !271, line: 51, baseType: !11, size: 32)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !270, file: !271, line: 54, baseType: !106, size: 64, offset: 64)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !270, file: !271, line: 55, baseType: !106, size: 64, offset: 128)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !270, file: !271, line: 56, baseType: !106, size: 64, offset: 192)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !270, file: !271, line: 57, baseType: !106, size: 64, offset: 256)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !270, file: !271, line: 58, baseType: !106, size: 64, offset: 320)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !270, file: !271, line: 59, baseType: !106, size: 64, offset: 384)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !270, file: !271, line: 60, baseType: !106, size: 64, offset: 448)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !270, file: !271, line: 61, baseType: !106, size: 64, offset: 512)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !270, file: !271, line: 64, baseType: !106, size: 64, offset: 576)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !270, file: !271, line: 65, baseType: !106, size: 64, offset: 640)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !270, file: !271, line: 66, baseType: !106, size: 64, offset: 704)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !270, file: !271, line: 68, baseType: !286, size: 64, offset: 768)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64)
!287 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !271, line: 36, flags: DIFlagFwdDecl, identifier: "_ZTS10_IO_marker")
!288 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !270, file: !271, line: 70, baseType: !289, size: 64, offset: 832)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !270, file: !271, line: 72, baseType: !11, size: 32, offset: 896)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !270, file: !271, line: 73, baseType: !11, size: 32, offset: 928)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !270, file: !271, line: 74, baseType: !293, size: 64, offset: 960)
!293 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !294, line: 152, baseType: !88)
!294 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!295 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !270, file: !271, line: 77, baseType: !296, size: 16, offset: 1024)
!296 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !270, file: !271, line: 78, baseType: !75, size: 8, offset: 1040)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !270, file: !271, line: 79, baseType: !299, size: 8, offset: 1048)
!299 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 8, elements: !300)
!300 = !{!301}
!301 = !DISubrange(count: 1)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !270, file: !271, line: 81, baseType: !303, size: 64, offset: 1088)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !271, line: 43, baseType: null)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !270, file: !271, line: 89, baseType: !306, size: 64, offset: 1152)
!306 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !294, line: 153, baseType: !88)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !270, file: !271, line: 91, baseType: !308, size: 64, offset: 1216)
!308 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64)
!309 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !271, line: 37, flags: DIFlagFwdDecl, identifier: "_ZTS11_IO_codecvt")
!310 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !270, file: !271, line: 92, baseType: !311, size: 64, offset: 1280)
!311 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !312, size: 64)
!312 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !271, line: 38, flags: DIFlagFwdDecl, identifier: "_ZTS13_IO_wide_data")
!313 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !270, file: !271, line: 93, baseType: !289, size: 64, offset: 1344)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !270, file: !271, line: 94, baseType: !40, size: 64, offset: 1408)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !270, file: !271, line: 95, baseType: !316, size: 64, offset: 1472)
!316 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !317, line: 46, baseType: !53)
!317 = !DIFile(filename: "OpenRace-env/install/lib/clang/10.0.1/include/stddef.h", directory: "/home/brad/Code")
!318 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !270, file: !271, line: 96, baseType: !11, size: 32, offset: 1536)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !270, file: !271, line: 98, baseType: !320, size: 160, offset: 1568)
!320 = !DICompositeType(tag: DW_TAG_array_type, baseType: !47, size: 160, elements: !321)
!321 = !{!322}
!322 = !DISubrange(count: 20)
!323 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !324, file: !254, line: 145)
!324 = !DISubprogram(name: "fgetws", scope: !260, file: !260, line: 758, type: !325, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!325 = !DISubroutineType(types: !326)
!326 = !{!327, !329, !11, !330}
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64)
!328 = !DIBasicType(name: "wchar_t", size: 32, encoding: DW_ATE_signed)
!329 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !327)
!330 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !267)
!331 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !332, file: !254, line: 146)
!332 = !DISubprogram(name: "fputwc", scope: !260, file: !260, line: 743, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!333 = !DISubroutineType(types: !334)
!334 = !{!256, !328, !267}
!335 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !336, file: !254, line: 147)
!336 = !DISubprogram(name: "fputws", scope: !260, file: !260, line: 765, type: !337, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!337 = !DISubroutineType(types: !338)
!338 = !{!11, !339, !330}
!339 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !340)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !328)
!342 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !343, file: !254, line: 148)
!343 = !DISubprogram(name: "fwide", scope: !260, file: !260, line: 573, type: !344, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!344 = !DISubroutineType(types: !345)
!345 = !{!11, !267, !11}
!346 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !347, file: !254, line: 149)
!347 = !DISubprogram(name: "fwprintf", scope: !260, file: !260, line: 580, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!348 = !DISubroutineType(types: !349)
!349 = !{!11, !330, !339, null}
!350 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !351, file: !254, line: 150)
!351 = !DISubprogram(name: "fwscanf", linkageName: "__isoc99_fwscanf", scope: !260, file: !260, line: 642, type: !348, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!352 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !353, file: !254, line: 151)
!353 = !DISubprogram(name: "getwc", scope: !260, file: !260, line: 730, type: !265, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!354 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !355, file: !254, line: 152)
!355 = !DISubprogram(name: "getwchar", scope: !260, file: !260, line: 736, type: !356, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!356 = !DISubroutineType(types: !357)
!357 = !{!256}
!358 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !359, file: !254, line: 153)
!359 = !DISubprogram(name: "mbrlen", scope: !260, file: !260, line: 329, type: !360, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!360 = !DISubroutineType(types: !361)
!361 = !{!316, !362, !316, !363}
!362 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !45)
!363 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !364)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !239, size: 64)
!365 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !366, file: !254, line: 154)
!366 = !DISubprogram(name: "mbrtowc", scope: !260, file: !260, line: 296, type: !367, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!367 = !DISubroutineType(types: !368)
!368 = !{!316, !329, !362, !316, !363}
!369 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !370, file: !254, line: 155)
!370 = !DISubprogram(name: "mbsinit", scope: !260, file: !260, line: 292, type: !371, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!371 = !DISubroutineType(types: !372)
!372 = !{!11, !373}
!373 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !374, size: 64)
!374 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !239)
!375 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !376, file: !254, line: 156)
!376 = !DISubprogram(name: "mbsrtowcs", scope: !260, file: !260, line: 337, type: !377, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!377 = !DISubroutineType(types: !378)
!378 = !{!316, !329, !379, !316, !363}
!379 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !380)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!381 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !382, file: !254, line: 157)
!382 = !DISubprogram(name: "putwc", scope: !260, file: !260, line: 744, type: !333, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!383 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !384, file: !254, line: 158)
!384 = !DISubprogram(name: "putwchar", scope: !260, file: !260, line: 750, type: !385, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!385 = !DISubroutineType(types: !386)
!386 = !{!256, !328}
!387 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !388, file: !254, line: 160)
!388 = !DISubprogram(name: "swprintf", scope: !260, file: !260, line: 590, type: !389, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!389 = !DISubroutineType(types: !390)
!390 = !{!11, !329, !316, !339, null}
!391 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !392, file: !254, line: 162)
!392 = !DISubprogram(name: "swscanf", linkageName: "__isoc99_swscanf", scope: !260, file: !260, line: 649, type: !393, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!393 = !DISubroutineType(types: !394)
!394 = !{!11, !339, !339, null}
!395 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !396, file: !254, line: 163)
!396 = !DISubprogram(name: "ungetwc", scope: !260, file: !260, line: 773, type: !397, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!397 = !DISubroutineType(types: !398)
!398 = !{!256, !256, !267}
!399 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !400, file: !254, line: 164)
!400 = !DISubprogram(name: "vfwprintf", scope: !260, file: !260, line: 598, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!401 = !DISubroutineType(types: !402)
!402 = !{!11, !330, !339, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !404, size: 64)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__va_list_tag", file: !29, size: 192, flags: DIFlagTypePassByValue, elements: !405, identifier: "_ZTS13__va_list_tag")
!405 = !{!406, !407, !408, !409}
!406 = !DIDerivedType(tag: DW_TAG_member, name: "gp_offset", scope: !404, file: !29, baseType: !36, size: 32)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "fp_offset", scope: !404, file: !29, baseType: !36, size: 32, offset: 32)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "overflow_arg_area", scope: !404, file: !29, baseType: !40, size: 64, offset: 64)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "reg_save_area", scope: !404, file: !29, baseType: !40, size: 64, offset: 128)
!410 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !254, line: 166)
!411 = !DISubprogram(name: "vfwscanf", linkageName: "__isoc99_vfwscanf", scope: !260, file: !260, line: 696, type: !401, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!412 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !413, file: !254, line: 169)
!413 = !DISubprogram(name: "vswprintf", scope: !260, file: !260, line: 611, type: !414, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!414 = !DISubroutineType(types: !415)
!415 = !{!11, !329, !316, !339, !403}
!416 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !254, line: 172)
!417 = !DISubprogram(name: "vswscanf", linkageName: "__isoc99_vswscanf", scope: !260, file: !260, line: 703, type: !418, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!418 = !DISubroutineType(types: !419)
!419 = !{!11, !339, !339, !403}
!420 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !421, file: !254, line: 174)
!421 = !DISubprogram(name: "vwprintf", scope: !260, file: !260, line: 606, type: !422, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!422 = !DISubroutineType(types: !423)
!423 = !{!11, !339, !403}
!424 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !425, file: !254, line: 176)
!425 = !DISubprogram(name: "vwscanf", linkageName: "__isoc99_vwscanf", scope: !260, file: !260, line: 700, type: !422, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!426 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !427, file: !254, line: 178)
!427 = !DISubprogram(name: "wcrtomb", scope: !260, file: !260, line: 301, type: !428, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!428 = !DISubroutineType(types: !429)
!429 = !{!316, !430, !328, !363}
!430 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !106)
!431 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !432, file: !254, line: 179)
!432 = !DISubprogram(name: "wcscat", scope: !260, file: !260, line: 97, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!433 = !DISubroutineType(types: !434)
!434 = !{!327, !329, !339}
!435 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !436, file: !254, line: 180)
!436 = !DISubprogram(name: "wcscmp", scope: !260, file: !260, line: 106, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!437 = !DISubroutineType(types: !438)
!438 = !{!11, !340, !340}
!439 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !440, file: !254, line: 181)
!440 = !DISubprogram(name: "wcscoll", scope: !260, file: !260, line: 131, type: !437, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!441 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !442, file: !254, line: 182)
!442 = !DISubprogram(name: "wcscpy", scope: !260, file: !260, line: 87, type: !433, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!443 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !444, file: !254, line: 183)
!444 = !DISubprogram(name: "wcscspn", scope: !260, file: !260, line: 187, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!445 = !DISubroutineType(types: !446)
!446 = !{!316, !340, !340}
!447 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !448, file: !254, line: 184)
!448 = !DISubprogram(name: "wcsftime", scope: !260, file: !260, line: 837, type: !449, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!449 = !DISubroutineType(types: !450)
!450 = !{!316, !329, !316, !339, !451}
!451 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !452)
!452 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !453, size: 64)
!453 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !454)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", file: !455, line: 7, flags: DIFlagFwdDecl, identifier: "_ZTS2tm")
!455 = !DIFile(filename: "/usr/include/bits/types/struct_tm.h", directory: "")
!456 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !457, file: !254, line: 185)
!457 = !DISubprogram(name: "wcslen", scope: !260, file: !260, line: 222, type: !458, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!458 = !DISubroutineType(types: !459)
!459 = !{!316, !340}
!460 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !461, file: !254, line: 186)
!461 = !DISubprogram(name: "wcsncat", scope: !260, file: !260, line: 101, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!462 = !DISubroutineType(types: !463)
!463 = !{!327, !329, !339, !316}
!464 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !465, file: !254, line: 187)
!465 = !DISubprogram(name: "wcsncmp", scope: !260, file: !260, line: 109, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!466 = !DISubroutineType(types: !467)
!467 = !{!11, !340, !340, !316}
!468 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !469, file: !254, line: 188)
!469 = !DISubprogram(name: "wcsncpy", scope: !260, file: !260, line: 92, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!470 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !471, file: !254, line: 189)
!471 = !DISubprogram(name: "wcsrtombs", scope: !260, file: !260, line: 343, type: !472, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!472 = !DISubroutineType(types: !473)
!473 = !{!316, !430, !474, !316, !363}
!474 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !475)
!475 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64)
!476 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !477, file: !254, line: 190)
!477 = !DISubprogram(name: "wcsspn", scope: !260, file: !260, line: 191, type: !445, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!478 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !479, file: !254, line: 191)
!479 = !DISubprogram(name: "wcstod", scope: !260, file: !260, line: 377, type: !480, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!480 = !DISubroutineType(types: !481)
!481 = !{!482, !339, !483}
!482 = !DIBasicType(name: "double", size: 64, encoding: DW_ATE_float)
!483 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !484)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !327, size: 64)
!485 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !486, file: !254, line: 193)
!486 = !DISubprogram(name: "wcstof", scope: !260, file: !260, line: 382, type: !487, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!487 = !DISubroutineType(types: !488)
!488 = !{!489, !339, !483}
!489 = !DIBasicType(name: "float", size: 32, encoding: DW_ATE_float)
!490 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !491, file: !254, line: 195)
!491 = !DISubprogram(name: "wcstok", scope: !260, file: !260, line: 217, type: !492, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!492 = !DISubroutineType(types: !493)
!493 = !{!327, !329, !339, !483}
!494 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !495, file: !254, line: 196)
!495 = !DISubprogram(name: "wcstol", scope: !260, file: !260, line: 428, type: !496, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!496 = !DISubroutineType(types: !497)
!497 = !{!88, !339, !483, !11}
!498 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !499, file: !254, line: 197)
!499 = !DISubprogram(name: "wcstoul", scope: !260, file: !260, line: 433, type: !500, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!500 = !DISubroutineType(types: !501)
!501 = !{!53, !339, !483, !11}
!502 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !503, file: !254, line: 198)
!503 = !DISubprogram(name: "wcsxfrm", scope: !260, file: !260, line: 135, type: !504, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!504 = !DISubroutineType(types: !505)
!505 = !{!316, !329, !339, !316}
!506 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !507, file: !254, line: 199)
!507 = !DISubprogram(name: "wctob", scope: !260, file: !260, line: 324, type: !508, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!508 = !DISubroutineType(types: !509)
!509 = !{!11, !256}
!510 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !511, file: !254, line: 200)
!511 = !DISubprogram(name: "wmemcmp", scope: !260, file: !260, line: 258, type: !466, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!512 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !513, file: !254, line: 201)
!513 = !DISubprogram(name: "wmemcpy", scope: !260, file: !260, line: 262, type: !462, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!514 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !515, file: !254, line: 202)
!515 = !DISubprogram(name: "wmemmove", scope: !260, file: !260, line: 267, type: !516, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!516 = !DISubroutineType(types: !517)
!517 = !{!327, !327, !340, !316}
!518 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !519, file: !254, line: 203)
!519 = !DISubprogram(name: "wmemset", scope: !260, file: !260, line: 271, type: !520, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!520 = !DISubroutineType(types: !521)
!521 = !{!327, !327, !328, !316}
!522 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !523, file: !254, line: 204)
!523 = !DISubprogram(name: "wprintf", scope: !260, file: !260, line: 587, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!524 = !DISubroutineType(types: !525)
!525 = !{!11, !339, null}
!526 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !527, file: !254, line: 205)
!527 = !DISubprogram(name: "wscanf", linkageName: "__isoc99_wscanf", scope: !260, file: !260, line: 646, type: !524, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!528 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !529, file: !254, line: 206)
!529 = !DISubprogram(name: "wcschr", scope: !260, file: !260, line: 164, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!530 = !DISubroutineType(types: !531)
!531 = !{!327, !340, !328}
!532 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !533, file: !254, line: 207)
!533 = !DISubprogram(name: "wcspbrk", scope: !260, file: !260, line: 201, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!534 = !DISubroutineType(types: !535)
!535 = !{!327, !340, !340}
!536 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !537, file: !254, line: 208)
!537 = !DISubprogram(name: "wcsrchr", scope: !260, file: !260, line: 174, type: !530, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!538 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !539, file: !254, line: 209)
!539 = !DISubprogram(name: "wcsstr", scope: !260, file: !260, line: 212, type: !534, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!540 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !541, file: !254, line: 210)
!541 = !DISubprogram(name: "wmemchr", scope: !260, file: !260, line: 253, type: !542, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!542 = !DISubroutineType(types: !543)
!543 = !{!327, !340, !328, !316}
!544 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !545, file: !254, line: 251)
!545 = !DISubprogram(name: "wcstold", scope: !260, file: !260, line: 384, type: !546, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!546 = !DISubroutineType(types: !547)
!547 = !{!548, !339, !483}
!548 = !DIBasicType(name: "long double", size: 128, encoding: DW_ATE_float)
!549 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !550, file: !254, line: 260)
!550 = !DISubprogram(name: "wcstoll", scope: !260, file: !260, line: 441, type: !551, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!551 = !DISubroutineType(types: !552)
!552 = !{!553, !339, !483, !11}
!553 = !DIBasicType(name: "long long int", size: 64, encoding: DW_ATE_signed)
!554 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !555, file: !254, line: 261)
!555 = !DISubprogram(name: "wcstoull", scope: !260, file: !260, line: 448, type: !556, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!556 = !DISubroutineType(types: !557)
!557 = !{!558, !339, !483, !11}
!558 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!559 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !545, file: !254, line: 267)
!560 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !550, file: !254, line: 268)
!561 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !555, file: !254, line: 269)
!562 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !486, file: !254, line: 283)
!563 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !411, file: !254, line: 286)
!564 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !417, file: !254, line: 289)
!565 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !425, file: !254, line: 292)
!566 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !545, file: !254, line: 296)
!567 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !550, file: !254, line: 297)
!568 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !555, file: !254, line: 298)
!569 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !570, file: !571, line: 58)
!570 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "exception_ptr", scope: !572, file: !571, line: 80, size: 64, flags: DIFlagTypePassByReference | DIFlagNonTrivial, elements: !573, identifier: "_ZTSNSt15__exception_ptr13exception_ptrE")
!571 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/exception_ptr.h", directory: "")
!572 = !DINamespace(name: "__exception_ptr", scope: !2)
!573 = !{!574, !575, !579, !582, !583, !588, !589, !593, !598, !602, !606, !609, !610, !613, !616}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "_M_exception_object", scope: !570, file: !571, line: 82, baseType: !40, size: 64)
!575 = !DISubprogram(name: "exception_ptr", scope: !570, file: !571, line: 84, type: !576, scopeLine: 84, flags: DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!576 = !DISubroutineType(types: !577)
!577 = !{null, !578, !40}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !570, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!579 = !DISubprogram(name: "_M_addref", linkageName: "_ZNSt15__exception_ptr13exception_ptr9_M_addrefEv", scope: !570, file: !571, line: 86, type: !580, scopeLine: 86, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!580 = !DISubroutineType(types: !581)
!581 = !{null, !578}
!582 = !DISubprogram(name: "_M_release", linkageName: "_ZNSt15__exception_ptr13exception_ptr10_M_releaseEv", scope: !570, file: !571, line: 87, type: !580, scopeLine: 87, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!583 = !DISubprogram(name: "_M_get", linkageName: "_ZNKSt15__exception_ptr13exception_ptr6_M_getEv", scope: !570, file: !571, line: 89, type: !584, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!584 = !DISubroutineType(types: !585)
!585 = !{!40, !586}
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !587, size: 64, flags: DIFlagArtificial | DIFlagObjectPointer)
!587 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !570)
!588 = !DISubprogram(name: "exception_ptr", scope: !570, file: !571, line: 97, type: !580, scopeLine: 97, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!589 = !DISubprogram(name: "exception_ptr", scope: !570, file: !571, line: 99, type: !590, scopeLine: 99, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!590 = !DISubroutineType(types: !591)
!591 = !{null, !578, !592}
!592 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !587, size: 64)
!593 = !DISubprogram(name: "exception_ptr", scope: !570, file: !571, line: 102, type: !594, scopeLine: 102, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!594 = !DISubroutineType(types: !595)
!595 = !{null, !578, !596}
!596 = !DIDerivedType(tag: DW_TAG_typedef, name: "nullptr_t", scope: !2, file: !113, line: 264, baseType: !597)
!597 = !DIBasicType(tag: DW_TAG_unspecified_type, name: "decltype(nullptr)")
!598 = !DISubprogram(name: "exception_ptr", scope: !570, file: !571, line: 106, type: !599, scopeLine: 106, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!599 = !DISubroutineType(types: !600)
!600 = !{null, !578, !601}
!601 = !DIDerivedType(tag: DW_TAG_rvalue_reference_type, baseType: !570, size: 64)
!602 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSERKS0_", scope: !570, file: !571, line: 119, type: !603, scopeLine: 119, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!603 = !DISubroutineType(types: !604)
!604 = !{!605, !578, !592}
!605 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !570, size: 64)
!606 = !DISubprogram(name: "operator=", linkageName: "_ZNSt15__exception_ptr13exception_ptraSEOS0_", scope: !570, file: !571, line: 123, type: !607, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!607 = !DISubroutineType(types: !608)
!608 = !{!605, !578, !601}
!609 = !DISubprogram(name: "~exception_ptr", scope: !570, file: !571, line: 130, type: !580, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!610 = !DISubprogram(name: "swap", linkageName: "_ZNSt15__exception_ptr13exception_ptr4swapERS0_", scope: !570, file: !571, line: 133, type: !611, scopeLine: 133, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!611 = !DISubroutineType(types: !612)
!612 = !{null, !578, !605}
!613 = !DISubprogram(name: "operator bool", linkageName: "_ZNKSt15__exception_ptr13exception_ptrcvbEv", scope: !570, file: !571, line: 145, type: !614, scopeLine: 145, flags: DIFlagPublic | DIFlagExplicit | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!614 = !DISubroutineType(types: !615)
!615 = !{!13, !586}
!616 = !DISubprogram(name: "__cxa_exception_type", linkageName: "_ZNKSt15__exception_ptr13exception_ptr20__cxa_exception_typeEv", scope: !570, file: !571, line: 154, type: !617, scopeLine: 154, flags: DIFlagPublic | DIFlagPrototyped, spFlags: DISPFlagOptimized)
!617 = !DISubroutineType(types: !618)
!618 = !{!619, !586}
!619 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !620, size: 64)
!620 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !621)
!621 = !DICompositeType(tag: DW_TAG_class_type, name: "type_info", scope: !2, file: !622, line: 88, flags: DIFlagFwdDecl, identifier: "_ZTSSt9type_info")
!622 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/typeinfo", directory: "")
!623 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !572, entity: !624, file: !571, line: 74)
!624 = !DISubprogram(name: "rethrow_exception", linkageName: "_ZSt17rethrow_exceptionNSt15__exception_ptr13exception_ptrE", scope: !2, file: !571, line: 70, type: !625, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!625 = !DISubroutineType(types: !626)
!626 = !{null, !570}
!627 = !DIImportedEntity(tag: DW_TAG_imported_module, scope: !628, entity: !629, file: !630, line: 58)
!628 = !DINamespace(name: "__gnu_debug", scope: null)
!629 = !DINamespace(name: "__debug", scope: !2)
!630 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/debug/debug.h", directory: "")
!631 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !632, file: !635, line: 47)
!632 = !DIDerivedType(tag: DW_TAG_typedef, name: "int8_t", file: !633, line: 24, baseType: !634)
!633 = !DIFile(filename: "/usr/include/bits/stdint-intn.h", directory: "")
!634 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int8_t", file: !294, line: 37, baseType: !75)
!635 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cstdint", directory: "")
!636 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !637, file: !635, line: 48)
!637 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !633, line: 25, baseType: !638)
!638 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !294, line: 39, baseType: !639)
!639 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!640 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !641, file: !635, line: 49)
!641 = !DIDerivedType(tag: DW_TAG_typedef, name: "int32_t", file: !633, line: 26, baseType: !642)
!642 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int32_t", file: !294, line: 41, baseType: !11)
!643 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !644, file: !635, line: 50)
!644 = !DIDerivedType(tag: DW_TAG_typedef, name: "int64_t", file: !633, line: 27, baseType: !645)
!645 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int64_t", file: !294, line: 44, baseType: !88)
!646 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !647, file: !635, line: 52)
!647 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast8_t", file: !648, line: 58, baseType: !75)
!648 = !DIFile(filename: "/usr/include/stdint.h", directory: "")
!649 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !650, file: !635, line: 53)
!650 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast16_t", file: !648, line: 60, baseType: !88)
!651 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !652, file: !635, line: 54)
!652 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast32_t", file: !648, line: 61, baseType: !88)
!653 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !654, file: !635, line: 55)
!654 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_fast64_t", file: !648, line: 62, baseType: !88)
!655 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !656, file: !635, line: 57)
!656 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least8_t", file: !648, line: 43, baseType: !657)
!657 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least8_t", file: !294, line: 52, baseType: !634)
!658 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !659, file: !635, line: 58)
!659 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least16_t", file: !648, line: 44, baseType: !660)
!660 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least16_t", file: !294, line: 54, baseType: !638)
!661 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !662, file: !635, line: 59)
!662 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least32_t", file: !648, line: 45, baseType: !663)
!663 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least32_t", file: !294, line: 56, baseType: !642)
!664 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !665, file: !635, line: 60)
!665 = !DIDerivedType(tag: DW_TAG_typedef, name: "int_least64_t", file: !648, line: 46, baseType: !666)
!666 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int_least64_t", file: !294, line: 58, baseType: !645)
!667 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !668, file: !635, line: 62)
!668 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !648, line: 101, baseType: !669)
!669 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intmax_t", file: !294, line: 72, baseType: !88)
!670 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !671, file: !635, line: 63)
!671 = !DIDerivedType(tag: DW_TAG_typedef, name: "intptr_t", file: !229, line: 267, baseType: !672)
!672 = !DIDerivedType(tag: DW_TAG_typedef, name: "__intptr_t", file: !294, line: 207, baseType: !88)
!673 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !674, file: !635, line: 65)
!674 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !675, line: 24, baseType: !676)
!675 = !DIFile(filename: "/usr/include/bits/stdint-uintn.h", directory: "")
!676 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint8_t", file: !294, line: 38, baseType: !78)
!677 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !678, file: !635, line: 66)
!678 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !675, line: 25, baseType: !679)
!679 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !294, line: 40, baseType: !296)
!680 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !681, file: !635, line: 67)
!681 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint32_t", file: !675, line: 26, baseType: !682)
!682 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint32_t", file: !294, line: 42, baseType: !36)
!683 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !684, file: !635, line: 68)
!684 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !675, line: 27, baseType: !685)
!685 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint64_t", file: !294, line: 45, baseType: !53)
!686 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !687, file: !635, line: 70)
!687 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast8_t", file: !648, line: 71, baseType: !78)
!688 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !689, file: !635, line: 71)
!689 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast16_t", file: !648, line: 73, baseType: !53)
!690 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !691, file: !635, line: 72)
!691 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast32_t", file: !648, line: 74, baseType: !53)
!692 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !693, file: !635, line: 73)
!693 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_fast64_t", file: !648, line: 75, baseType: !53)
!694 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !695, file: !635, line: 75)
!695 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least8_t", file: !648, line: 49, baseType: !696)
!696 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least8_t", file: !294, line: 53, baseType: !676)
!697 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !698, file: !635, line: 76)
!698 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least16_t", file: !648, line: 50, baseType: !699)
!699 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least16_t", file: !294, line: 55, baseType: !679)
!700 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !701, file: !635, line: 77)
!701 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least32_t", file: !648, line: 51, baseType: !702)
!702 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least32_t", file: !294, line: 57, baseType: !682)
!703 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !704, file: !635, line: 78)
!704 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint_least64_t", file: !648, line: 52, baseType: !705)
!705 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint_least64_t", file: !294, line: 59, baseType: !685)
!706 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !707, file: !635, line: 80)
!707 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintmax_t", file: !648, line: 102, baseType: !708)
!708 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uintmax_t", file: !294, line: 73, baseType: !53)
!709 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !710, file: !635, line: 81)
!710 = !DIDerivedType(tag: DW_TAG_typedef, name: "uintptr_t", file: !648, line: 90, baseType: !53)
!711 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !712, file: !714, line: 53)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", file: !713, line: 51, flags: DIFlagFwdDecl, identifier: "_ZTS5lconv")
!713 = !DIFile(filename: "/usr/include/locale.h", directory: "")
!714 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/clocale", directory: "")
!715 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !716, file: !714, line: 54)
!716 = !DISubprogram(name: "setlocale", scope: !713, file: !713, line: 122, type: !717, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!717 = !DISubroutineType(types: !718)
!718 = !{!106, !11, !45}
!719 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !720, file: !714, line: 55)
!720 = !DISubprogram(name: "localeconv", scope: !713, file: !713, line: 125, type: !721, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!721 = !DISubroutineType(types: !722)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!724 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !725, file: !729, line: 64)
!725 = !DISubprogram(name: "isalnum", scope: !726, file: !726, line: 108, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!726 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!727 = !DISubroutineType(types: !728)
!728 = !{!11, !11}
!729 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cctype", directory: "")
!730 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !731, file: !729, line: 65)
!731 = !DISubprogram(name: "isalpha", scope: !726, file: !726, line: 109, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!732 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !733, file: !729, line: 66)
!733 = !DISubprogram(name: "iscntrl", scope: !726, file: !726, line: 110, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!734 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !735, file: !729, line: 67)
!735 = !DISubprogram(name: "isdigit", scope: !726, file: !726, line: 111, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!736 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !737, file: !729, line: 68)
!737 = !DISubprogram(name: "isgraph", scope: !726, file: !726, line: 113, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!738 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !739, file: !729, line: 69)
!739 = !DISubprogram(name: "islower", scope: !726, file: !726, line: 112, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!740 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !741, file: !729, line: 70)
!741 = !DISubprogram(name: "isprint", scope: !726, file: !726, line: 114, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!742 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !743, file: !729, line: 71)
!743 = !DISubprogram(name: "ispunct", scope: !726, file: !726, line: 115, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!744 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !745, file: !729, line: 72)
!745 = !DISubprogram(name: "isspace", scope: !726, file: !726, line: 116, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!746 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !747, file: !729, line: 73)
!747 = !DISubprogram(name: "isupper", scope: !726, file: !726, line: 117, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!748 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !749, file: !729, line: 74)
!749 = !DISubprogram(name: "isxdigit", scope: !726, file: !726, line: 118, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!750 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !751, file: !729, line: 75)
!751 = !DISubprogram(name: "tolower", scope: !726, file: !726, line: 122, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!752 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !753, file: !729, line: 76)
!753 = !DISubprogram(name: "toupper", scope: !726, file: !726, line: 125, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!754 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !755, file: !729, line: 87)
!755 = !DISubprogram(name: "isblank", scope: !726, file: !726, line: 130, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!756 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !757, file: !759, line: 52)
!757 = !DISubprogram(name: "abs", scope: !758, file: !758, line: 840, type: !727, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!758 = !DIFile(filename: "/usr/include/stdlib.h", directory: "")
!759 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/bits/std_abs.h", directory: "")
!760 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !761, file: !763, line: 127)
!761 = !DIDerivedType(tag: DW_TAG_typedef, name: "div_t", file: !758, line: 62, baseType: !762)
!762 = !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 58, flags: DIFlagFwdDecl, identifier: "_ZTS5div_t")
!763 = !DIFile(filename: "/usr/lib64/gcc/x86_64-pc-linux-gnu/10.2.0/../../../../include/c++/10.2.0/cstdlib", directory: "")
!764 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !765, file: !763, line: 128)
!765 = !DIDerivedType(tag: DW_TAG_typedef, name: "ldiv_t", file: !758, line: 70, baseType: !766)
!766 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 66, size: 128, flags: DIFlagTypePassByValue, elements: !767, identifier: "_ZTS6ldiv_t")
!767 = !{!768, !769}
!768 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !766, file: !758, line: 68, baseType: !88, size: 64)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !766, file: !758, line: 69, baseType: !88, size: 64, offset: 64)
!770 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !771, file: !763, line: 130)
!771 = !DISubprogram(name: "abort", scope: !758, file: !758, line: 591, type: !772, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!772 = !DISubroutineType(types: !773)
!773 = !{null}
!774 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !775, file: !763, line: 134)
!775 = !DISubprogram(name: "atexit", scope: !758, file: !758, line: 595, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!776 = !DISubroutineType(types: !777)
!777 = !{!11, !778}
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !772, size: 64)
!779 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !780, file: !763, line: 137)
!780 = !DISubprogram(name: "at_quick_exit", scope: !758, file: !758, line: 600, type: !776, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!781 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !782, file: !763, line: 140)
!782 = !DISubprogram(name: "atof", scope: !783, file: !783, line: 25, type: !784, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!783 = !DIFile(filename: "/usr/include/bits/stdlib-float.h", directory: "")
!784 = !DISubroutineType(types: !785)
!785 = !{!482, !45}
!786 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !787, file: !763, line: 141)
!787 = !DISubprogram(name: "atoi", scope: !758, file: !758, line: 361, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!788 = !DISubroutineType(types: !789)
!789 = !{!11, !45}
!790 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !791, file: !763, line: 142)
!791 = !DISubprogram(name: "atol", scope: !758, file: !758, line: 366, type: !792, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!792 = !DISubroutineType(types: !793)
!793 = !{!88, !45}
!794 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !795, file: !763, line: 143)
!795 = !DISubprogram(name: "bsearch", scope: !796, file: !796, line: 20, type: !797, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!796 = !DIFile(filename: "/usr/include/bits/stdlib-bsearch.h", directory: "")
!797 = !DISubroutineType(types: !798)
!798 = !{!40, !118, !118, !316, !316, !799}
!799 = !DIDerivedType(tag: DW_TAG_typedef, name: "__compar_fn_t", file: !758, line: 808, baseType: !800)
!800 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !801, size: 64)
!801 = !DISubroutineType(types: !802)
!802 = !{!11, !118, !118}
!803 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !804, file: !763, line: 144)
!804 = !DISubprogram(name: "calloc", scope: !758, file: !758, line: 542, type: !805, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!805 = !DISubroutineType(types: !806)
!806 = !{!40, !316, !316}
!807 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !808, file: !763, line: 145)
!808 = !DISubprogram(name: "div", scope: !758, file: !758, line: 852, type: !809, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!809 = !DISubroutineType(types: !810)
!810 = !{!761, !11, !11}
!811 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !812, file: !763, line: 146)
!812 = !DISubprogram(name: "exit", scope: !758, file: !758, line: 617, type: !813, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!813 = !DISubroutineType(types: !814)
!814 = !{null, !11}
!815 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !816, file: !763, line: 147)
!816 = !DISubprogram(name: "free", scope: !758, file: !758, line: 565, type: !206, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!817 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !818, file: !763, line: 148)
!818 = !DISubprogram(name: "getenv", scope: !758, file: !758, line: 634, type: !819, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!819 = !DISubroutineType(types: !820)
!820 = !{!106, !45}
!821 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !822, file: !763, line: 149)
!822 = !DISubprogram(name: "labs", scope: !758, file: !758, line: 841, type: !823, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!823 = !DISubroutineType(types: !824)
!824 = !{!88, !88}
!825 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !826, file: !763, line: 150)
!826 = !DISubprogram(name: "ldiv", scope: !758, file: !758, line: 854, type: !827, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!827 = !DISubroutineType(types: !828)
!828 = !{!765, !88, !88}
!829 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !830, file: !763, line: 151)
!830 = !DISubprogram(name: "malloc", scope: !758, file: !758, line: 539, type: !831, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!831 = !DISubroutineType(types: !832)
!832 = !{!40, !316}
!833 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !834, file: !763, line: 153)
!834 = !DISubprogram(name: "mblen", scope: !758, file: !758, line: 922, type: !835, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!835 = !DISubroutineType(types: !836)
!836 = !{!11, !45, !316}
!837 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !838, file: !763, line: 154)
!838 = !DISubprogram(name: "mbstowcs", scope: !758, file: !758, line: 933, type: !839, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!839 = !DISubroutineType(types: !840)
!840 = !{!316, !329, !362, !316}
!841 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !842, file: !763, line: 155)
!842 = !DISubprogram(name: "mbtowc", scope: !758, file: !758, line: 925, type: !843, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!843 = !DISubroutineType(types: !844)
!844 = !{!11, !329, !362, !316}
!845 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !846, file: !763, line: 157)
!846 = !DISubprogram(name: "qsort", scope: !758, file: !758, line: 830, type: !847, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!847 = !DISubroutineType(types: !848)
!848 = !{null, !40, !316, !316, !799}
!849 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !850, file: !763, line: 160)
!850 = !DISubprogram(name: "quick_exit", scope: !758, file: !758, line: 623, type: !813, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!851 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !852, file: !763, line: 163)
!852 = !DISubprogram(name: "rand", scope: !758, file: !758, line: 453, type: !853, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!853 = !DISubroutineType(types: !854)
!854 = !{!11}
!855 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !856, file: !763, line: 164)
!856 = !DISubprogram(name: "realloc", scope: !758, file: !758, line: 550, type: !857, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!857 = !DISubroutineType(types: !858)
!858 = !{!40, !40, !316}
!859 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !860, file: !763, line: 165)
!860 = !DISubprogram(name: "srand", scope: !758, file: !758, line: 455, type: !861, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!861 = !DISubroutineType(types: !862)
!862 = !{null, !36}
!863 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !864, file: !763, line: 166)
!864 = !DISubprogram(name: "strtod", scope: !758, file: !758, line: 117, type: !865, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!865 = !DISubroutineType(types: !866)
!866 = !{!482, !362, !867}
!867 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !868)
!868 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!869 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !870, file: !763, line: 167)
!870 = !DISubprogram(name: "strtol", scope: !758, file: !758, line: 176, type: !871, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!871 = !DISubroutineType(types: !872)
!872 = !{!88, !362, !867, !11}
!873 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !874, file: !763, line: 168)
!874 = !DISubprogram(name: "strtoul", scope: !758, file: !758, line: 180, type: !875, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!875 = !DISubroutineType(types: !876)
!876 = !{!53, !362, !867, !11}
!877 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !878, file: !763, line: 169)
!878 = !DISubprogram(name: "system", scope: !758, file: !758, line: 784, type: !788, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!879 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !880, file: !763, line: 171)
!880 = !DISubprogram(name: "wcstombs", scope: !758, file: !758, line: 937, type: !881, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!881 = !DISubroutineType(types: !882)
!882 = !{!316, !430, !339, !316}
!883 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !884, file: !763, line: 172)
!884 = !DISubprogram(name: "wctomb", scope: !758, file: !758, line: 929, type: !885, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!885 = !DISubroutineType(types: !886)
!886 = !{!11, !106, !328}
!887 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !888, file: !763, line: 200)
!888 = !DIDerivedType(tag: DW_TAG_typedef, name: "lldiv_t", file: !758, line: 80, baseType: !889)
!889 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !758, line: 76, size: 128, flags: DIFlagTypePassByValue, elements: !890, identifier: "_ZTS7lldiv_t")
!890 = !{!891, !892}
!891 = !DIDerivedType(tag: DW_TAG_member, name: "quot", scope: !889, file: !758, line: 78, baseType: !553, size: 64)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "rem", scope: !889, file: !758, line: 79, baseType: !553, size: 64, offset: 64)
!893 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !894, file: !763, line: 206)
!894 = !DISubprogram(name: "_Exit", scope: !758, file: !758, line: 629, type: !813, flags: DIFlagPrototyped | DIFlagNoReturn, spFlags: DISPFlagOptimized)
!895 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !896, file: !763, line: 210)
!896 = !DISubprogram(name: "llabs", scope: !758, file: !758, line: 844, type: !897, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!897 = !DISubroutineType(types: !898)
!898 = !{!553, !553}
!899 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !900, file: !763, line: 216)
!900 = !DISubprogram(name: "lldiv", scope: !758, file: !758, line: 858, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!901 = !DISubroutineType(types: !902)
!902 = !{!888, !553, !553}
!903 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !904, file: !763, line: 227)
!904 = !DISubprogram(name: "atoll", scope: !758, file: !758, line: 373, type: !905, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!905 = !DISubroutineType(types: !906)
!906 = !{!553, !45}
!907 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !908, file: !763, line: 228)
!908 = !DISubprogram(name: "strtoll", scope: !758, file: !758, line: 200, type: !909, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!909 = !DISubroutineType(types: !910)
!910 = !{!553, !362, !867, !11}
!911 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !912, file: !763, line: 229)
!912 = !DISubprogram(name: "strtoull", scope: !758, file: !758, line: 205, type: !913, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!913 = !DISubroutineType(types: !914)
!914 = !{!558, !362, !867, !11}
!915 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !916, file: !763, line: 231)
!916 = !DISubprogram(name: "strtof", scope: !758, file: !758, line: 123, type: !917, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!917 = !DISubroutineType(types: !918)
!918 = !{!489, !362, !867}
!919 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !96, entity: !920, file: !763, line: 232)
!920 = !DISubprogram(name: "strtold", scope: !758, file: !758, line: 126, type: !921, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!921 = !DISubroutineType(types: !922)
!922 = !{!548, !362, !867}
!923 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !888, file: !763, line: 240)
!924 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !894, file: !763, line: 242)
!925 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !896, file: !763, line: 244)
!926 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !927, file: !763, line: 245)
!927 = !DISubprogram(name: "div", linkageName: "_ZN9__gnu_cxx3divExx", scope: !96, file: !763, line: 213, type: !901, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized)
!928 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !900, file: !763, line: 246)
!929 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !904, file: !763, line: 248)
!930 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !916, file: !763, line: 249)
!931 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !908, file: !763, line: 250)
!932 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !912, file: !763, line: 251)
!933 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !920, file: !763, line: 252)
!934 = !DIImportedEntity(tag: DW_TAG_imported_declaration, scope: !2, entity: !935, file: !937, line: 98)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !936, line: 7, baseType: !270)
