; ModuleID = 'integration/dataracebench/DRB049-fprintf-orig-no.c'
source_filename = "integration/dataracebench/DRB049-fprintf-orig-no.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, %struct._IO_codecvt*, %struct._IO_wide_data*, %struct._IO_FILE*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type opaque
%struct._IO_codecvt = type opaque
%struct._IO_wide_data = type opaque
%struct.ident_t = type { i32, i32, i32, i32, i8* }

@.str = private unnamed_addr constant [15 x i8] c"mytempfile.txt\00", align 1
@.str.1 = private unnamed_addr constant [3 x i8] c"a+\00", align 1
@stderr = external dso_local global %struct._IO_FILE*, align 8
@.str.2 = private unnamed_addr constant [18 x i8] c"Error in fopen()\0A\00", align 1
@.str.3 = private unnamed_addr constant [23 x i8] c";unknown;unknown;0;0;;\00", align 1
@0 = private unnamed_addr global %struct.ident_t { i32 0, i32 514, i32 0, i32 0, i8* getelementptr inbounds ([23 x i8], [23 x i8]* @.str.3, i32 0, i32 0) }, align 8
@1 = private unnamed_addr constant [64 x i8] c";integration/dataracebench/DRB049-fprintf-orig-no.c;main;69;1;;\00", align 1
@.str.4 = private unnamed_addr constant [4 x i8] c"%d\0A\00", align 1

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 10.0.1 ", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3, splitDebugInlining: false, nameTableKind: None)
!1 = !DIFile(filename: "integration/dataracebench/DRB049-fprintf-orig-no.c", directory: "/home/brad/Code/OpenRace/tests/data")
!2 = !{}
!3 = !{!4, !5, !68}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!5 = !DISubprogram(name: "fclose", scope: !6, file: !6, line: 213, type: !7, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!6 = !DIFile(filename: "/usr/include/stdio.h", directory: "")
!7 = !DISubroutineType(types: !8)
!8 = !{!9, !10}
!9 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!10 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !11, size: 64)
!11 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_FILE", file: !12, line: 49, size: 1728, elements: !13)
!12 = !DIFile(filename: "/usr/include/bits/types/struct_FILE.h", directory: "")
!13 = !{!14, !15, !18, !19, !20, !21, !22, !23, !24, !25, !26, !27, !28, !31, !32, !33, !34, !38, !40, !42, !46, !49, !51, !54, !57, !58, !59, !63, !64}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "_flags", scope: !11, file: !12, line: 51, baseType: !9, size: 32)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_ptr", scope: !11, file: !12, line: 54, baseType: !16, size: 64, offset: 64)
!16 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !17, size: 64)
!17 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_end", scope: !11, file: !12, line: 55, baseType: !16, size: 64, offset: 128)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_read_base", scope: !11, file: !12, line: 56, baseType: !16, size: 64, offset: 192)
!20 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_base", scope: !11, file: !12, line: 57, baseType: !16, size: 64, offset: 256)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_ptr", scope: !11, file: !12, line: 58, baseType: !16, size: 64, offset: 320)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_write_end", scope: !11, file: !12, line: 59, baseType: !16, size: 64, offset: 384)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_base", scope: !11, file: !12, line: 60, baseType: !16, size: 64, offset: 448)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_buf_end", scope: !11, file: !12, line: 61, baseType: !16, size: 64, offset: 512)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_base", scope: !11, file: !12, line: 64, baseType: !16, size: 64, offset: 576)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_backup_base", scope: !11, file: !12, line: 65, baseType: !16, size: 64, offset: 640)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "_IO_save_end", scope: !11, file: !12, line: 66, baseType: !16, size: 64, offset: 704)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "_markers", scope: !11, file: !12, line: 68, baseType: !29, size: 64, offset: 768)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_marker", file: !12, line: 36, flags: DIFlagFwdDecl)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_chain", scope: !11, file: !12, line: 70, baseType: !10, size: 64, offset: 832)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_fileno", scope: !11, file: !12, line: 72, baseType: !9, size: 32, offset: 896)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_flags2", scope: !11, file: !12, line: 73, baseType: !9, size: 32, offset: 928)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_old_offset", scope: !11, file: !12, line: 74, baseType: !35, size: 64, offset: 960)
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !36, line: 152, baseType: !37)
!36 = !DIFile(filename: "/usr/include/bits/types.h", directory: "")
!37 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_cur_column", scope: !11, file: !12, line: 77, baseType: !39, size: 16, offset: 1024)
!39 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_vtable_offset", scope: !11, file: !12, line: 78, baseType: !41, size: 8, offset: 1040)
!41 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_shortbuf", scope: !11, file: !12, line: 79, baseType: !43, size: 8, offset: 1048)
!43 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 8, elements: !44)
!44 = !{!45}
!45 = !DISubrange(count: 1)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_lock", scope: !11, file: !12, line: 81, baseType: !47, size: 64, offset: 1088)
!47 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !48, size: 64)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "_IO_lock_t", file: !12, line: 43, baseType: null)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_offset", scope: !11, file: !12, line: 89, baseType: !50, size: 64, offset: 1152)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !36, line: 153, baseType: !37)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_codecvt", scope: !11, file: !12, line: 91, baseType: !52, size: 64, offset: 1216)
!52 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !53, size: 64)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_codecvt", file: !12, line: 37, flags: DIFlagFwdDecl)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_wide_data", scope: !11, file: !12, line: 92, baseType: !55, size: 64, offset: 1280)
!55 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !56, size: 64)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "_IO_wide_data", file: !12, line: 38, flags: DIFlagFwdDecl)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_list", scope: !11, file: !12, line: 93, baseType: !10, size: 64, offset: 1344)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_freeres_buf", scope: !11, file: !12, line: 94, baseType: !4, size: 64, offset: 1408)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__pad5", scope: !11, file: !12, line: 95, baseType: !60, size: 64, offset: 1472)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !61, line: 46, baseType: !62)
!61 = !DIFile(filename: "OpenRace-env/install/lib/clang/10.0.1/include/stddef.h", directory: "/home/brad/Code")
!62 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_mode", scope: !11, file: !12, line: 96, baseType: !9, size: 32, offset: 1536)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_unused2", scope: !11, file: !12, line: 98, baseType: !65, size: 160, offset: 1568)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !17, size: 160, elements: !66)
!66 = !{!67}
!67 = !DISubrange(count: 20)
!68 = !DISubprogram(name: "remove", scope: !6, file: !6, line: 146, type: !69, flags: DIFlagPrototyped, spFlags: DISPFlagOptimized, retainedNodes: !2)
!69 = !DISubroutineType(types: !70)
!70 = !{!9, !71}
!71 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !72, size: 64)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !17)
!73 = !{i32 7, !"Dwarf Version", i32 4}
!74 = !{i32 2, !"Debug Info Version", i32 3}
!75 = !{i32 1, !"wchar_size", i32 4}
!76 = !{!"clang version 10.0.1 "}
!77 = distinct !DISubprogram(name: "main", scope: !1, file: !1, line: 51, type: !78, scopeLine: 52, flags: DIFlagPrototyped | DIFlagAllCallsDescribed, spFlags: DISPFlagDefinition | DISPFlagOptimized, unit: !0, retainedNodes: !81)
!78 = !DISubroutineType(types: !79)
!79 = !{!9, !9, !80}
!80 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !16, size: 64)
!81 = !{!82, !83, !84, !85, !86, !90, !91}
!82 = !DILocalVariable(name: "argc", arg: 1, scope: !77, file: !1, line: 51, type: !9)
!83 = !DILocalVariable(name: "argv", arg: 2, scope: !77, file: !1, line: 51, type: !80)
!84 = !DILocalVariable(name: "i", scope: !77, file: !1, line: 53, type: !9)
!85 = !DILocalVariable(name: "ret", scope: !77, file: !1, line: 54, type: !9)
!86 = !DILocalVariable(name: "pfile", scope: !77, file: !1, line: 55, type: !87)
!87 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !88, size: 64)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !89, line: 7, baseType: !11)
!89 = !DIFile(filename: "/usr/include/bits/types/FILE.h", directory: "")
!90 = !DILocalVariable(name: "len", scope: !77, file: !1, line: 56, type: !9)
!91 = !DILocalVariable(name: "A", scope: !77, file: !1, line: 58, type: !92)
!92 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 32000, elements: !93)
!93 = !{!94}
!94 = !DISubrange(count: 1000)
!95 = !{!96, !96, i64 0}
!96 = !{!"int", !97, i64 0}
!97 = !{!"omnipotent char", !98, i64 0}
!98 = !{!"Simple C/C++ TBAA"}
!99 = !DILocation(line: 51, column: 14, scope: !77)
!100 = !{!101, !101, i64 0}
!101 = !{!"any pointer", !97, i64 0}
!102 = !DILocation(line: 51, column: 26, scope: !77)
!103 = !DILocation(line: 53, column: 3, scope: !77)
!104 = !DILocation(line: 53, column: 7, scope: !77)
!105 = !DILocation(line: 54, column: 3, scope: !77)
!106 = !DILocation(line: 54, column: 7, scope: !77)
!107 = !DILocation(line: 55, column: 3, scope: !77)
!108 = !DILocation(line: 55, column: 9, scope: !77)
!109 = !DILocation(line: 56, column: 3, scope: !77)
!110 = !DILocation(line: 56, column: 7, scope: !77)
!111 = !DILocation(line: 58, column: 3, scope: !77)
!112 = !DILocation(line: 58, column: 7, scope: !77)
!113 = !DILocation(line: 60, column: 9, scope: !114)
!114 = distinct !DILexicalBlock(scope: !77, file: !1, line: 60, column: 3)
!115 = !DILocation(line: 60, column: 8, scope: !114)
!116 = !DILocation(line: 60, column: 13, scope: !117)
!117 = distinct !DILexicalBlock(scope: !114, file: !1, line: 60, column: 3)
!118 = !DILocation(line: 60, column: 15, scope: !117)
!119 = !DILocation(line: 60, column: 14, scope: !117)
!120 = !DILocation(line: 60, column: 3, scope: !114)
!121 = !DILocation(line: 61, column: 10, scope: !117)
!122 = !DILocation(line: 61, column: 7, scope: !117)
!123 = !DILocation(line: 61, column: 5, scope: !117)
!124 = !DILocation(line: 61, column: 9, scope: !117)
!125 = !DILocation(line: 60, column: 21, scope: !117)
!126 = !DILocation(line: 60, column: 3, scope: !117)
!127 = distinct !{!127, !120, !128}
!128 = !DILocation(line: 61, column: 10, scope: !114)
!129 = !DILocation(line: 63, column: 11, scope: !77)
!130 = !DILocation(line: 63, column: 9, scope: !77)
!131 = !DILocation(line: 64, column: 7, scope: !132)
!132 = distinct !DILexicalBlock(scope: !77, file: !1, line: 64, column: 7)
